DraenorTreasures = LibStub("AceAddon-3.0"):NewAddon("DraenorTreasures", "AceBucket-3.0", "AceConsole-3.0", "AceEvent-3.0", "AceTimer-3.0")
local HandyNotes = LibStub("AceAddon-3.0"):GetAddon("HandyNotes", true)

if not HandyNotes then return end

local iconDefaults = {
    default = "Interface\\Icons\\TRADE_ARCHAEOLOGY_CHESTOFTINYGLASSANIMALS",
    unknown = "Interface\\Addons\\HandyNotes_DraenorTreasures\\Artwork\\chest_normal_daily.tga",
    swprare = "Interface\\Icons\\Trade_Archaeology_Fossil_SnailShell",
    shrine = "Interface\\Icons\\inv_misc_statue_02",
    glider = "Interface\\Icons\\inv_feather_04",
    rocket = "Interface\\Icons\\ability_mount_rocketmount",
    skull_blue = "Interface\\Addons\\HandyNotes_DraenorTreasures\\Artwork\\RareIconBlue.tga",
    skull_green = "Interface\\Addons\\HandyNotes_DraenorTreasures\\Artwork\\RareIconGreen.tga",
    skull_grey = "Interface\\Addons\\HandyNotes_DraenorTreasures\\Artwork\\RareIcon.tga",
    skull_orange = "Interface\\Addons\\HandyNotes_DraenorTreasures\\Artwork\\RareIconOrange.tga",
    skull_purple = "Interface\\Addons\\HandyNotes_DraenorTreasures\\Artwork\\RareIconPurple.tga",
    skull_red = "Interface\\Addons\\HandyNotes_DraenorTreasures\\Artwork\\RareIconRed.tga",
    skull_yellow = "Interface\\Addons\\HandyNotes_DraenorTreasures\\Artwork\\RareIconYellow.tga",
}

local PlayerFaction, _ = UnitFactionGroup("player")
DraenorTreasures.nodes = { }

local nodes = DraenorTreasures.nodes
local isTomTomloaded = false
local isDBMloaded = false
local isHN_LRTloaded = false


nodes["ShadowmoonValleyDR"] = {
	[54924501]={ "35581", "煉金師的背袋", "草藥", "", "default", "treasure_smv","109124"},
	[52834837]={ "35584", "先祖巨斧", "等級519 力量 雙手 斧", "", "default", "treasure_smv","113560"},
	[41422798]={ "33869", "裝甲伊萊克獠牙", "等級518 額外護甲值 飾品 (使用後提高精通)", "", "default", "treasure_smv","108902"},
	[37784435]={ "33584", "阿坤伯的骨灰", "增加5%充份休息經驗", "", "default", "treasure_smv","113531"},
	[49313760]={ "33867", "占星師的箱子", "玩具", "在二樓", "default", "treasure_smv","109739"},
	[36774142]={ "33046", "摯愛的獻禮", "趣味物品 - 副手物品", "", "default", "treasure_smv","113547"},
	[37182313]={ "33613", "冒泡的大鍋", "等級516 智力 副手物品", "在山洞內; 入口在略向東北的方位, 座標：38, 22.3", "default", "treasure_smv","108945"},
	[84564478]={ "33885", "掠鴉女王的貨物", "", "", "default", "treasure_smv","824"},
	[33453961]={ "33569", "雕花角杯", "恢復法力物品(50分鐘冷卻)", "", "default", "treasure_smv","113545"},
	[61706800]={ "34743", "托爾瓦斯水晶劍", "垃圾物品", "點擊物品並擊敗三棵古樹才能拾取物品", "default", "treasure_smv","111636"},
	[20383065]={ "33575", "惡魔儲物箱", "等級550 智力 頸部", "", "default", "treasure_smv","108904"},
	[29853748]={ "36879", "覆蓋灰層的帶鎖箱", "裝綁綠裝 + 金錢", "在巨大石拱的頂部,需由西邊山坡上的石拱開始跳過來", "default", "treasure_smv",""},
	[51753549]={ "33037", "分層的罐子", "金錢", "", "default", "treasure_smv",""},
	[26530568]={ "34174", "夢幻之魚", "", "", "default", "treasure_smv","824"},
	[34394623]={ "33891", "巨型月柳果實", "等級522 魔杖", "", "default", "treasure_smv","108901"},
	[48724753]={ "35798", "發光的洞穴蘑菇", "草藥", "", "default", "treasure_smv","109127"},
	[38484308]={ "33614", "哥雷卡之甕", "等級528 加速 飾品 (攻擊觸發力量)", "", "default", "treasure_smv","113408"},
	[47154603]={ "33564", "掛著的背袋", "等級518 皮甲 手", "在上方洞口,可在山頂上拾取", "default", "treasure_smv","108900"},
	[42106130]={ "33041", "鋼鐵部落裝箱貨物", "", "", "default", "treasure_smv","824"},
	[37515925]={ "33567", "鋼鐵部落貢品", "等級523 雙擊 飾品 (使用後範圍傷害)", "", "default", "treasure_smv","108903"},
	[57924531]={ "33568", "卡里瑞蛋", "", "25 要塞資源", "default", "treasure_smv","113271"},
	[58882193]={ "35603", "米卡爾的箱子", "垃圾物品", "", "default", "treasure_smv","113215"},
	[52882486]={ "37254", "長滿蘑菇的箱子", "", "", "default", "treasure_smv","824"},
	[66963349]={ "36507", "獸人骷髏", "等級526 力量 戒指", "", "default", "treasure_smv","116875"},
	[43756062]={ "33611", "祥和祭品", "垃圾物品", "", "default", "treasure_smv","107650"},
	[45226049]={ "33610", "祥和祭品", "垃圾物品", "", "default", "treasure_smv","107650"},
	[44486357]={ "33384", "祥和祭品", "垃圾物品", "", "default", "treasure_smv","107650"},
	[44495914]={ "33612", "祥和祭品", "垃圾物品", "", "default", "treasure_smv","107650"},
	[31223905]={ "33886", "羅諾克的東西", "等級522 力量 背部", "", "default", "treasure_smv","109081"},
	[22893385]={ "33572", "腐爛的籃子", "垃圾物品", "在山洞內", "default", "treasure_smv","113373"},
	[36684455]={ "33573", "羅沃的匕首", "等級520 敏捷 匕首", "", "default", "treasure_smv","113378"},
	[67058418]={ "33565", "剝落的萊拉克蛋", "垃圾物品", "!!! 等級100區域 !!!", "default", "treasure_smv","44722"},
	[45822458]={ "33570", "影月流放者寶藏", "25 要塞資源", "在流放者高地下方的山洞內", "default", "treasure_smv","113388"},
	[29994536]={ "35919", "影月獻祭匕首", "等級524 智力 匕首", "", "default", "treasure_smv","113563"},
	[28233924]={ "33883", "影月寶藏", "", "", "default", "treasure_smv","824"},
	[27050248]={ "35280", "失竊的寶藏", "", "", "default", "treasure_smv","824"},
	[55821997]={ "35600", "奇異孢子", "寵物", "在巨大蘑菇的頂部; 從埃羅多爾的最頂處爬山過去", "default", "treasure_smv","118104"},
	[37192601]={ "35677", "沉沒的漁船", "趣味物品", "", "default", "treasure_smv","118414"},
	[28820720]={ "35279", "水下寶藏", "", "", "default", "treasure_smv","824"},
	[55297487]={ "35580", "沼澤熒光蟲巢", "玩具", "", "default", "treasure_smv","117550"},
	[35854087]={ "33540", "烏茲科的雜物", "等級525 皮甲 腳", "", "default", "treasure_smv","113546"},
	[34214353]={ "33866", "威瑪的草藥包", "草藥", "", "default", "treasure_smv","109124"},
	[51147912]={ "33574", "復仇者的儲物箱", "玩具", "!!! 等級100區域 !!!", "default", "treasure_smv","113375"},
	[39208391]={ "33566", "浸水的箱子", "等級520 力量 單手 拳頭 + 要塞資源", "", "default", "treasure_smv","113372"},
	[37203640]={ "33061", "阿瑪烏卡", "等級516 鎖甲 手", "在附近一大片區域內飛行", "skull_grey", "rare_smv","109060"},
	[51007900]={ "37356", "亞奎利爾", "等級620 智力 戒指 (機率掉落)", "!!! 等級101 !!! 要殺死所有薩格萊束縛者才能攻擊", "skull_blue", "rare_h_smv","119387"},
	[67308470]={ "37410", "雪崩", "等級620 力量 單手 錘 (機率掉落)", "!!! 等級100 !!! 這怪物可能會卡在地板下,接近他來觸發戰鬥", "skull_blue", "rare_h_smv","119400"},
	[52801680]={ "35731", "巴潤", "無增益效果的食物 (能重覆使用;5分鐘冷卻)", "", "skull_grey", "rare_smv","113540"},
	[45307770]={ "33383", "藤王菲利", "等級620 敏捷 法杖 (機率掉落)", "!!! 等級100 !!! 這個稀有並沒有每日重置拾取,需要等待官方修復", "skull_blue", "rare_h_smv","117551"},
	[48604360]={ "33064", "黑暗聚化體", "等級516 智力 拳套", "在山洞內; 要殺死所有影月虛無低語者才能攻擊", "skull_grey", "rare_smv","109075"},
	[41008300]={ "35448", "黑暗之主戈維德", "等級525 智力 法杖 (使用後召喚蝦怪協助戰鬥)", "", "skull_grey", "rare_smv","113548"},
	[49604200]={ "35555", "暗爪", "等級520 敏捷 背部", "", "skull_grey", "rare_smv","113541"},
	[46007160]={ "37351", "德米多斯", "等級620 坦克 頸部 (機率掉落) + 寵物 (低機率掉落) + 成就", "!!! 等級102 !!! 位於索奎薩爾高地,需要由東南邊的石頭跳上去", "skull_green", "rare_h_smv","119377"},
	[67906390]={ "35688", "恩娜菈", "等級523 智力 頸部", "點擊恩娜菈的屍體並和她的靈魂戰鬥", "skull_grey", "rare_smv","113556"},
	[61706160]={ "35725", "靈光", "等級526 皮甲 腿部", "", "skull_grey", "rare_smv","113557"},
	[37404880]={ "35558", "催眠蟾蜍", "玩具", "在瀑布後面,可以在瀑布下面的石頭跳上去或在瀑布上面用滑翔道具進入", "skull_green", "rare_smv","113631"},
	[57404840]={ "35909", "因夏塔", "等級520 鎖甲 腳", "", "skull_grey", "rare_smv","113571"},
	[40804440]={ "33043", "戮顎", "等級516 敏捷 匕首", "", "skull_grey", "rare_smv","109078"},
	[32503510]={ "33039", "『虛無先知』庫塔格", "等級516 鎖甲 手", "", "skull_grey", "rare_smv","109061"},
	[48107760]={ "37355", "坦波泰莎女士", "等級620 皮甲 腳 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_smv","119360"},
	[37601460]={ "33055", "識葉者庫里", "等級518 臨機應變 飾品 (擊殺觸發治療)", "", "skull_grey", "rare_smv","108907"},
	[44802080]={ "35906", "瘋『王』斯波里昂", "等級519 敏捷 法杖", "", "skull_grey", "rare_smv","113561"},
	[29605080]={ "37357", "馬爾格許‧守影", "等級620 鎖甲 頭部 (機率掉落)", "!!! 等級100 !!! 在山洞內; 入口座標：29,52", "skull_blue", "rare_h_smv","119369"},
	[51807920]={ "37353", "上士彌格菈", "等級620 鎖甲 手 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_smv","119368"},
	[38607020]={ "35523", "茉娃‧曲魂者", "等級520 智力 單手 錘", "", "skull_grey", "rare_smv","113559"},
	[43905770]={ "33642", "女族長歐慕菈", "等級522 智力 飾品 (攻擊觸發精通)", "要殺死所有影月黑暗法師才能攻擊", "skull_grey", "rare_smv","113527"},
	[60808990]={ "37409", "奈吉德納", "等級620 皮甲 肩部 (機率掉落)", "!!! 等級100 !!! 在山洞內; 入口座標：59,89", "skull_blue", "rare_h_smv","119364"},
	[50407270]={ "37352", "軍需官赫薩克", "等級620 鎧甲 腿部 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_smv","119382"},
	[48602260]={ "35553", "萊沃許", "緩落物品", "", "skull_grey", "rare_smv","113542"},
	[52705080]={ "34068", "岩蹄", "等級516 力量 盾牌", "", "skull_grey", "rare_smv","109077"},
	[48208090]={ "37354", "影語者尼爾", "等級620 智力 匕首 (機率掉落)", "!!! 等級101 !!! 在空中", "skull_blue", "rare_h_smv","119396"},
	[61005520]={ "35732", "真理", "暫時性的400%陸地坐騎 (1小時冷卻;只能在影月谷使用)", "在附近一大片區域內漫步", "skull_grey", "rare_smv","113543"},
	[61708910]={ "37411", "裂喉", "等級620 力量 雙手 劍 (機率掉落)", "!!! 等級100 !!! 在山洞內; 入口座標：61,87", "skull_blue", "rare_h_smv","119411"},
	[27604360]={ "36880", "斯尼維爾", "等級519 布甲 腿部", "", "skull_grey", "rare_smv","118734"},
	[21602100]={ "33640", "維洛斯", "等級516 智力 戒指", "", "skull_grey", "rare_smv","108906"},
	[54807030]={ "33643", "毒葵", "等級516 皮甲 腳", "", "skull_grey", "rare_smv","108957"},
	[31905720]={ "37359", "虛無劫奪者烏爾妮", "等級620 敏捷 單手 斧 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_smv","119392"},
	[32604140]={ "35847", "虛無先知卡魯格", "等級516 布甲 腰部", "要殺死所有影月導魔師才能攻擊", "skull_grey", "rare_smv","109074"},
	[48806640]={ "33389", "伊格德雷", "玩具", "", "skull_green", "rare_smv","113570"},
	--[29405150]={ "37357", "Malgosh Shadowkeeper", "i620 Agility/Intellect Mail Helm", "!!! Level 100 !!!", "skull_blue", "rare_h_smv","119369"},(change the location to Spires of Arak)
    [54003040]={ "99999900", "路行者", "", "", "skull_orange", "mount_pr", "116773"},
    [43003220]={ "99999900", "路行者", "", "", "skull_orange", "mount_pr", "116773"},
    [39603660]={ "99999900", "路行者", "", "", "skull_orange", "mount_pr", "116773"},
    [44604380]={ "99999900", "路行者", "", "", "skull_orange", "mount_pr", "116773"},
    [56205240]={ "99999900", "路行者", "", "", "skull_orange", "mount_pr", "116773"},
    [45806820]={ "99999900", "路行者", "", "", "skull_orange", "mount_pr", "116773"},
    [41807570]={ "99999901", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [43607140]={ "99999901", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [46607020]={ "99999901", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [48807020]={ "99999901", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [50307150]={ "99999901", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [51707490]={ "99999901", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
	[29600620]={ "35281", "巴赫梅耶", "魚類", "", "skull_grey", "rare_smv","111666"},
	[21603300]={ "33664", "戈魯", "等級516 全屬性 戒指 (使用後能夠潛行)", "在山洞內", "skull_grey", "rare_smv","113082"},
}

nodes["FrostfireRidge"] = {
	[23172495]={ "33916", "競技場大師的戰爭號角", "玩具", "", "default", "treasure_ffr","108735"},
	[24242712]={ "33501", "觀眾置物箱", "酒精飲料", "在石拱的頂部,需由旁邊的塔頂跳過來", "default", "treasure_ffr","63293"},
	[61704250]={ "33511", "吞噬者的胃石", "等級516 智力 盾牌", "擊敗嚴霜蟲師並餵食『吞噬者』博若克10個嚴霜苦工後才能拾取; 擊殺後過快點擊或餵食後過快點擊嚴霜苦工可能會導致其消失", "default", "treasure_ffr","112110"},
	[42161930]={ "34520", "燃燒珍珠", "等級525 雙擊 飾品 (攻擊觸發精通)", "!!! 等級100區域 !!!", "default", "treasure_ffr","120341"},
	[50161870]={ "33531", "笨拙的壁槌蠻卒", "等級516 鎖甲 頭部", "!!! 等級100區域 !!! 在山崖上", "default", "treasure_ffr","112096"},
	[42663175]={ "33940", "躍壁者的儲物箱", "等級516 鎖甲 腳", "需跳上插在牆上的矛才能到達", "default", "treasure_ffr","112187"},
	[40902010]={ "34473", "使者的背袋", "垃圾物品", "!!! 等級100區域 !!!", "default", "treasure_ffr","110536"},
	[43665562]={ "34841", "遺忘的補給品", "", "", "default", "treasure_ffr","824"},
	[24184860]={ "34507", "霜狼寒詠者", "等級516 智力 單手 斧", "在山洞內", "default", "treasure_ffr","110689"},
	[57175216]={ "34476", "冰封寶藏", "等級516 精通 飾品 (攻擊觸發召喚守護者)", "需先擊殺所有冰凍怒靈才能拾取", "default", "treasure_ffr","111554"},
	[25522050]={ "34648", "啃過的骨頭", "等級516 敏捷 匕首", "", "default", "treasure_ffr","111415"},
	[66712640]={ "33948", "戈倫遺物", "25 要塞資源", "!!! 等級100區域 !!! 在山上的洞穴內; 上山路徑座標：69.3, 24", "default", "treasure_ffr","111543"},
	[68124586]={ "33947", "嚴霜實藏", "", "在塔頂", "default", "treasure_ffr","824"},
	[56727186]={ "36863", "鋼鐵部落軍需品", "", "", "default", "treasure_ffr","824"},
	[68906910]={ "33017", "鋼鐵部落補給品", "", "", "default", "treasure_ffr","824"},
	[21890963]={ "33926", "潟湖水池", "玩具", "需要釣魚技能", "default", "treasure_ffr","108739"},
	[19211202]={ "34642", "幸運硬幣", "趣味物品 - 幸運硬幣", "出售價格25G", "default", "treasure_ffr","111408"},
	[38303782]={ "33502", "黑曜石岩雕", "增加5%充份休息經驗", "在山上; 上山路徑座標：39, 42.5", "default", "treasure_ffr","112087"},
	--[28296663]={ "34470", "Pale Fishmonger", "Fish", "", "default", "treasure_ffr","111666"}, (is rare, not treasure)
	[21685076]={ "34931", "蒼白物品袋", "", "在山洞內", "default", "treasure_ffr","824"},
	[37265914]={ "34967", "劫來的戰利品", "", "在塔頂", "default", "treasure_ffr","824"},
	[09834533]={ "34641", "密封的罐子", "趣味物品 - 日誌", "", "default", "treasure_ffr","111407"},
	[27704280]={ "33500", "奴隸的儲物箱", "酒精飲料", "", "default", "treasure_ffr","43696"},
	[23971291]={ "34647", "覆雪保險箱", "金錢", "", "default", "treasure_ffr",""},
	[16124972]={ "33942", "補給堆", "", "在石崖上", "default", "treasure_ffr","824"},
	[64722573]={ "33946", "倖存者儲物箱", "", "", "default", "treasure_ffr","824"},
	[34192348]={ "32803", "雷霆王儲物箱", "等級516 敏捷/力量 長柄武器 (裝綁)", "", "default", "treasure_ffr","107658"},
	[64406586]={ "33505", "晃動的蛋", "寵物 (需3天時間孵化)", "在頂部,需由後方的雪坡爬上去", "default", "treasure_ffr","112107"},
	[54843545]={ "33525", "年輕的獸人旅者", "等級516 敏捷 頸部", "需要收集年輕的獸人女性的霜狼首牙並合併", "default", "treasure_ffr","112206"},
	[63401470]={ "33525", "年輕的獸人女性", "等級516 敏捷 頸部", "需要收集年輕的獸人旅者的雪兔腳並合併", "default", "treasure_ffr","112206"},
	[39661718]={ "33532", "壁槌儲物箱", "原始之魂 + 頂尖水晶", "!!! 等級100區域 !!!", "default", "treasure_ffr","120945"},
	--[45365034]={ "33011", "Grizzled Frostwolf Veteran", "i516 Trinket Stamina + 2% Heal on Kill", "Loot contained in Dusty Chest after talking to NPC and defeating waves of orcs", "default", "treasure_ffr","106899"},(only Horde can talk to the npc)
	[88605740]={ "37525", "『屠戮者』艾珂歐絲", "等級620 皮甲 腰部 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_ffr","119365"},
	[27405000]={ "34497", "絕息", "玩具", "", "skull_green", "rare_ffr","111476"},
	[66403140]={ "33843", "育母瑞格艾克", "等級516 智力 飾品 (攻擊觸發雙擊)", "在山洞內", "skull_grey", "rare_ffr","111533"},
	[33902300]={ "32941", "峽谷冰母蜥蜴", "25 要塞資源", "", "skull_grey", "rare_ffr","101436"},
	[41406830]={ "34843", "凜牙", "等級513 皮甲 腿部", "", "skull_grey", "rare_ffr","111953"},
	[40604710]={ "33014", "燼喉", "等級516 智力 匕首", "", "skull_grey", "rare_ffr","111490"},
	[25405500]={ "34129", "『哀慟』冷踏", "等級516 智力 頸部", "", "skull_grey", "rare_ffr","112066"},
	[54606940]={ "34131", "寒牙", "等級516 單手 劍", "", "skull_grey", "rare_ffr","111484"},
	[67407820]={ "34477", "颶風怒靈", "等級516 布甲 肩部", "", "skull_grey", "rare_ffr","112086"},
	[71004730]={ "33504", "火怒巨人", "等級516 智力 副手物品", "點擊火怒岩召喚", "skull_grey", "rare_ffr","107661"},
	[54702240]={ "32918", "巨人殺手庫爾", "等級516 臨機應變 飾品 (攻擊觸發敏捷)", "", "skull_grey", "rare_ffr","111530"},
	[71002760]={ "33512", "『熔岩暴飲者』格古阿克", "等級620 力量 拳套 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_ffr","111545"},
	--[70003600]={ "37388", "Gorivax", "i620 Intellect Cloth Bracer", "", "skull_blue", "rare_h_ffr","119358"}, (did not spawn after patch 6.1)
	[38706280]={ "34865", "『掠取者』戈魯塔什", "等級513 鎖甲 腿部", "", "skull_grey", "rare_ffr","112077"},
	[50405270]={ "34825", "戈魯克", "等級513 加速 飾品 (攻擊觸發致命一擊)", "", "skull_grey", "rare_ffr","111948"},
	[47205540]={ "34839", "古朗", "等級513 力量 背部", "在山洞內", "skull_grey", "rare_ffr","111955"},
	[68101990]={ "37382", "白霜", "等級620 智力 戒指 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_ffr","119415"},
	[58603420]={ "34130", "神獵手庫昂", "", "騎著裂蹄在附近一大片區域內漫步", "skull_grey", "rare_ffr","824"},
	[48202340]={ "37386", "喋顎", "等級620 智力 盾牌 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_ffr","119390"},
	[61802660]={ "34708", "『攀爬者』傑西爾", "等級516 皮甲 腳", "在骨架的頂部", "skull_grey", "rare_ffr","112078"},
	[42502180]={ "37387", "莫托諾馬", "等級620 布甲 肩部 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_ffr","119356"},
	[72502280]={ "37381", "戈倫之母", "等級620 力量 頸部 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_ffr","119376"},
	[83604720]={ "37402", "『割碎者』歐格姆", "等級620 皮甲 手腕 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_ffr","119366"},
	[37003380]={ "33938", "原獵者姆拉格", "等級516 布甲 腿部", "在山上; 上山路徑座標：40, 30; 沿着巨魔路標走", "skull_grey", "rare_ffr","111576"},
	[86904880]={ "37401", "雪原巡者雷高爾", "等級620 皮甲 胸部 (機率掉落)", "!!! 等級100 !!! 在山洞內", "skull_blue", "rare_h_ffr","119359"},
	[76606350]={ "34132", "斥候戈爾西克", "等級516 皮甲 胸部", "", "skull_grey", "rare_ffr","112094"},
	[44601530]={ "37385", "『食屍者』亂牙", "等級620 皮甲 頭部 (機率掉落)", "!!! 等級101 !!! 在山洞內", "skull_blue", "rare_h_ffr","119362"},
	[38201610]={ "37383", "葛拉瑪爾之子", "等級620 智力 單手 錘 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_ffr","119399"},
	[26903190]={ "34133", "痛毆者", "等級516 力量 雙手 錘", "在山洞內", "skull_grey", "rare_ffr","111475"},
	[72403310]={ "37361", "刺骨鑽行蟲", "等級620 鎧甲 胸部 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_ffr","111534"},
	[43500890]={ "37384", "托葛羅斯", "等級620 智力 副手物品 (機率掉落) + 玩具 (低機率掉落)", "!!! 等級101 !!!", "skull_green", "rare_h_ffr","119379"},
	[40301210]={ "34522", "『凍結者』烏格洛克", "等級620 智力 法杖 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_ffr","119409"},
	[68803230]={ "37378", "瓦爾寇", "100 要塞資源 (機率掉落)", "!!! 等級101 !!! 在附近一大片區域內漫步", "skull_blue", "rare_h_ffr","119416"},
	[70603900]={ "37379", "『長者』沃洛克", "100 要塞資源  (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_ffr","119416"},
	[40602760]={ "34559", "『刀疤』雅嘉", "等級516 皮甲 腰部", "", "skull_grey", "rare_ffr","111477"},
	[84204650]={ "37403", "震地者赫拉爾", "等級620 敏捷 頸部 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_ffr","119374"},
	[66602540]={ "37380", "『懦弱的』吉博列特", "等級620 敏捷 背部 (機率掉落) + 趣味物品 (機率掉落)", "!!! 等級101 !!! 在山上的洞穴內; 上山路徑座標：69.3, 24; 會逃走,需打斷施法", "skull_blue", "rare_h_ffr","119349"},
	[86904670]={ "37404", "『折鐵者』卡加", "等級620 鎖甲 腰部 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_ffr","119372"},
	[63407940]={ "99999902", "格洛克", "", "", "skull_orange", "mount_go", "116674"},
    [22806640]={ "99999902", "格洛克", "", "", "skull_orange", "mount_go", "116674"},
    [65205260]={ "99999902", "格洛克", "", "", "skull_orange", "mount_go", "116674"},
    [51805060]={ "99999902", "格洛克", "", "", "skull_orange", "mount_go", "116674"},
    [58001840]={ "99999902", "格洛克", "", "", "skull_orange", "mount_go", "116674"},
    [13205040]={ "99999903", "諾卡洛許", "", "", "skull_yellow", "mount_no", "116794"},
    [48002740]={ "99999904", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [51101990]={ "99999904", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [52301820]={ "99999904", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [53801730]={ "99999904", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
	[28296663]={ "34470", "蒼白魚販", "魚類", "", "skull_grey", "rare_ffr","109142"},
	[85105200]={ "37556", "『和平主義者』賈魯克", "只掉落頂尖水晶", "!!! 等級100 !!!", "skull_blue", "rare_h_ffr","823"},
	[30505090]={ "33438", "曲時之塔", "等級513 智力 頸部", "可以從4個巨魔身上拿到垃圾物品,金錢和裝備 (兩個巨魔在樑邊)", "default", "treasure_ffr","107662"},
	[30505090]={ "33439", "曲時之塔", "等級513 智力 頸部", "可以從4個巨魔身上拿到垃圾物品,金錢和裝備 (兩個巨魔在樑邊)", "default", "treasure_ffr","107662"},
	[30505090]={ "33440", "曲時之塔", "等級513 智力 頸部", "可以從4個巨魔身上拿到垃圾物品,金錢和裝備 (兩個巨魔在樑邊)", "default", "treasure_ffr","107662"},
	[30505090]={ "33497", "曲時之塔", "等級513 智力 頸部", "可以從4個巨魔身上拿到垃圾物品,金錢和裝備 (兩個巨魔在樑邊)", "default", "treasure_ffr","107662"},
	[36203230]={ "34649", "冒煙的真鐵礦床", "真鐵礦石 + 原始之魂", "在熔岩中間; 需要採礦技能", "default", "treasure_ffr","109119"},
	[26613949]={ "35370", "都羅格的秘密藏匿物", "金錢 + 垃圾物品", "位於劍刃庭院(第二層)的外面", "default", "treasure_ffr_bsf","113189"},
	[26403642]={ "35367", "戈爾索格的私藏美酒", "酒精飲料", "位於劍刃王座(頂層)", "default", "treasure_ffr_bsf","113108"},
	[26603520]={ "35347", "巨魔寶藏", "要塞資源", "位於劍刃庭院(第二層)", "default", "treasure_ffr_bsf","824"},
	[28293440]={ "35368", "巨魔寶藏", "金錢", "位於劍刃堡壘(底層); 需要跳上箱子才能拾取", "default", "treasure_ffr_bsf",""},
	[27783917]={ "35369", "巨魔寶藏", "金錢", "位於劍刃堡壘(底層); 需要跳上箱子才能拾取", "default", "treasure_ffr_bsf",""},
	[27603382]={ "35371", "巨魔寶藏", "金錢", "位於劍刃庭院(第二層)", "default", "treasure_ffr_bsf",""},
	[27173763]={ "35373", "巨魔寶藏", "金錢", "位於劍刃庭院(第二層); 需要跳上箱子才能拾取", "default", "treasure_ffr_bsf",""},
	[28093409]={ "35567", "巨魔寶藏", "要塞資源", "位於劍刃庭院(第二層)", "default", "treasure_ffr_bsf","824"},
	[30723869]={ "35568", "巨魔寶藏", "要塞資源", "位於劍刃庭院(第二層)", "default", "treasure_ffr_bsf","824"},
	[30083927]={ "35569", "巨魔寶藏", "要塞資源", "位於劍刃庭院(第二層)", "default", "treasure_ffr_bsf","824"},
	[27283876]={ "35570", "巨魔寶藏", "金錢", "位於劍刃堡壘(底層)", "default", "treasure_ffr_bsf",""},
}

nodes["BladespireFortress"] = {
	[37207020]={ "35370", "都羅格的秘密藏匿物", "金錢 + 垃圾物品", "位於劍刃庭院(第二層)的外面", "default", "treasure_ffr_bsf","113189"},
	[31406660]={ "35367", "戈爾索格的私藏美酒", "酒精飲料", "位於劍刃王座(頂層)", "default", "treasure_ffr_bsf","113108"},
	[36402880]={ "35347", "巨魔寶藏", "要塞資源", "位於劍刃庭院(第二層)", "default", "treasure_ffr_bsf","824"},
	[53202790]={ "35368", "巨魔寶藏", "金錢", "位於劍刃堡壘(底層); 需要跳上箱子才能拾取", "default", "treasure_ffr_bsf",""},
	[49006790]={ "35369", "巨魔寶藏", "金錢", "位於劍刃堡壘(底層); 需要跳上箱子才能拾取", "default", "treasure_ffr_bsf",""},
	[46301570]={ "35371", "巨魔寶藏", "金錢", "位於劍刃庭院(第二層)", "default", "treasure_ffr_bsf",""},
	[52205190]={ "35373", "巨魔寶藏", "金錢", "位於劍刃庭院(第二層); 需要跳上箱子才能拾取", "default", "treasure_ffr_bsf",""},
	[51401790]={ "35567", "巨魔寶藏", "要塞資源", "位於劍刃庭院(第二層)", "default", "treasure_ffr_bsf","824"},
	[76806210]={ "35568", "巨魔寶藏", "要塞資源", "位於劍刃庭院(第二層)", "default", "treasure_ffr_bsf","824"},
	[70606780]={ "35569", "巨魔寶藏", "要塞資源", "位於劍刃庭院(第二層)", "default", "treasure_ffr_bsf","824"},
	[44706450]={ "35570", "巨魔寶藏", "金錢", "位於劍刃堡壘(底層)", "default", "treasure_ffr_bsf",""},
}

nodes["Gorgrond"] = {
	[41735297]={ "36506", "布羅寇爾的袋子", "等級538 智力 法杖", "", "default", "treasure_gg","118702"},
	[42368341]={ "36625", "被丟棄的背包", "金錢 + 裝綁綠裝", "在樹根旁邊", "default", "treasure_gg",""},
	[41827802]={ "36658", "永晨補給箱", "裝綁綠裝", "", "default", "treasure_gg",""},
	[40367660]={ "36621", "探險者之罐", "50 要塞資源", "", "default", "treasure_gg","118710"},
	[40047223]={ "36170", "不太真實的大腿骨", "垃圾物品", "", "default", "treasure_gg","118715"},
	[46104999]={ "36651", "可以採收的珍貴水晶", "", "在山洞內", "default", "treasure_gg","824"},
	[42584685]={ "35056", "有角的頭骨", "", "在山洞內", "default", "treasure_gg","824"},
	[43694248]={ "36618", "鋼鐵補給箱", "", "在山洞內", "default", "treasure_gg","824"},
	[44207427]={ "35709", "獰笑骷髏儲物袋", "", "在樹上", "default", "treasure_gg","824"},
	[43109290]={ "34241", "歐克巴爾的背包", "垃圾物品", "", "default", "treasure_gg","118227"},
	[52516696]={ "36509", "奇怪的顱骨", "等級535 智力 副手物品", "", "default", "treasure_gg","118717"},
	[46244295]={ "36521", "石化萊拉克蛋", "垃圾物品", "", "default", "treasure_gg","118707"},
	[43957055]={ "36118", "礫石堆", "裝綁綠裝", "", "default", "treasure_gg",""},
	[53127449]={ "36654", "『碎礦者』巴力克的遺骸", "垃圾物品", "在山洞內", "default", "treasure_gg","118714"},
	[57845597]={ "36605", "伯迪爾‧迪普洛克的遺骸", "垃圾物品", "", "default", "treasure_gg","118703"},
	[39036805]={ "36631", "莎夏的秘密儲物袋", "金錢 + 裝綁綠裝", "在塔頂外面的木梁上", "default", "treasure_gg",""},
	[44954262]={ "36634", "狙擊手之弩", "等級539 弩", "", "default", "treasure_gg","118713"},
	[48129337]={ "36604", "藏起來的緊急背包", "金錢 + 裝綁綠裝", "需要跳躍技巧", "default", "treasure_gg",""},
	[52977995]={ "34940", "外觀奇怪的匕首", "等級537 敏捷 匕首", "在山洞內", "default", "treasure_gg","118718"},
	[57086530]={ "37249", "奇異孢子", "寵物", "在懸崖邊伸出的蘑菇片頂部", "default", "treasure_gg","118106"},
	[45694972]={ "36610", "日觸長矛", "垃圾物品", "", "default", "treasure_gg","118708"},
	[59296379]={ "36628", "復仇者之錘", "等級539 力量 雙手 錘", "在巨大蘑菇的頂部", "default", "treasure_gg","118712"},
	[48944731]={ "36203", "溫暖的戈倫蛋", "玩具 (需7天時間孵化)", "在山洞內", "default", "treasure_gg","118705"},
	[49284363]={ "36596", "武器架", "100 要塞資源", "", "default", "treasure_gg","107645"},
	[58704120]={ "37371", "艾卡利", "等級620 皮甲 手 (機率掉落)", "!!! 等級100 !!! 有三個刷新點", "skull_blue", "rare_h_gg","119361"},
	[40107890]={ "35335", "巴希歐克", "玩具", "", "skull_green", "rare_gg","118222"},
	[69204460]={ "37369", "巴斯頓 + 努特拉 + 瓦斯提爾", "等級620 布甲 腰部 (機率掉落) + 玩具 (低機率掉落)", "!!! 等級100 !!! 三個稀有共享掉落,必須全部打敗才能拾取", "skull_green", "rare_h_gg","119357"},
	[39407450]={ "36597", "貝索拉", "等級532 鎖甲 肩部", "在山洞內", "skull_grey", "rare_gg","118232"},
	[46003360]={ "37368", "大劍師羅格爾", "等級620 布甲 腳 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_gg","119228"},
	[53404460]={ "35503", "焦焰古樹", "等級536 智力 雙手 錘", "", "skull_grey", "rare_gg","118212"},
	[48202100]={ "37362", "背叛者達茲格", "等級620 力量 長柄武器 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_gg","119224"},
	[72604040]={ "37370", "深根", "等級620 敏捷 長柄武器 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_gg","119406"},
	--[72604040]={ "37370", "Depthroot", "i620 Agility Polearm", "!!! Level 100 !!! One of two possible Spawnpoints", "skull_blue", "rare_h_gg","119406"},
	[50002380]={ "37366", "被憎恨的德普", "等級620 敏捷 皮甲 腰部 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_gg","119225"},
	[72803580]={ "37373", "縱火者格拉許", "等級620 鎧甲 手 (機率掉落)", "!!! 等級100 !!! 有兩個刷新點", "skull_blue", "rare_h_gg","119381"},
	[57903660]={ "37373", "縱火者格拉許", "等級620 鎧甲 手 (機率掉落)", "!!! 等級100 !!! 有兩個刷新點", "skull_blue", "rare_h_gg","119381"},
	[57406860]={ "36387", "化石木", "玩具", "", "skull_green", "rare_gg","118221"},
	[41804540]={ "36391", "『蒼藍之焰』傑戈爾", "等級534 臨機應變 飾品 (攻擊觸發智力)", "在山洞內", "skull_grey", "rare_gg","118230"},
	[46205080]={ "36204", "巨吞", "等級534 敏捷 飾品 (攻擊觸發雙擊)", "在山洞內", "skull_grey", "rare_gg","118229"},
	[52805360]={ "37413", "瘤顎", "等級620 智力 拳套 (機率掉落)", "!!! 等級100 !!! 在山上的洞穴的底層", "skull_blue", "rare_h_gg","119397"},
	[46804300]={ "36186", "『狡詐者』格雷卓克", "等級534 力量 單手 錘", "在山洞內", "skull_grey", "rare_gg","118210"},
	[59704290]={ "37375", "林地守衛亞爾", "等級620 智力 背部 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_gg","119414"},
	[52407010]={ "35908", "蟲后絲克莉卡", "等級534 智力 單手 斧", "", "skull_grey", "rare_gg","118209"},
	[47002380]={ "37365", "霍爾格", "等級620 鎖甲 胸部 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_gg","119229"},
	[54904620]={ "37377", "獵人芭爾菈", "等級620 弓 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_gg","119412"},
	[47603060]={ "37367", "發明者布蘭茉", "等級620 槍械 (機率掉落) + 趣味物品 (機率掉落)", "!!! 等級101 !!! 在山崖上", "skull_blue", "rare_h_gg","119226"},
	[52205580]={ "37412", "軟泥怪之王", "等級620 力量 背部 (機率掉落)", "!!! 等級100 !!! 在山上的洞穴的底層", "skull_blue", "rare_h_gg","119351"},
	[50805330]={ "36178", "曼德拉寇", "寵物", "", "skull_green", "rare_gg","118709"},
	[49003380]={ "37363", "瘋狂的馬德加爾", "等級620 智力 頸部 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_gg","119230"},
	[61803930]={ "37376", "莫加馬格", "等級620 力量 盾牌 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_gg","119391"},
	[47002580]={ "37364", "莫戈肯恩", "等級620 鎧甲 頭部 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_gg","119227"},
	[53407820]={ "34726", "蜘蛛育母", "等級534 敏捷 匕首", "在山洞內", "skull_grey", "rare_gg","118208"},
	[37608140]={ "36600", "暴猛龍", "等級539 智力 匕首", "", "skull_grey", "rare_gg","118231"},
	[47804140]={ "36393", "羅寇爾", "等級539 力量 飾品 (攻擊觸發致命一擊)", "", "skull_grey", "rare_gg","118211"},
	[54207240]={ "36837", "巨蹄", "等級537 雙手 斧", "", "skull_grey", "rare_gg","118228"},
	[38206620]={ "35910", "踐踏者克里格", "趣味物品 - 可以制作酒精飲料 (7天冷卻時間)", "", "skull_grey", "rare_gg","118224"},
	[40205960]={ "36394", "索菲里歐斯", "玩具", "", "skull_green", "rare_gg","114227"},
	[44609220]={ "36656", "日爪", "等級533 敏捷 拳套", "使用登山繩爬上去", "skull_grey", "rare_gg","118223"},
	[59503200]={ "37374", "迅捷的黑瑪瑙撕掠者", "等級620 鎖甲 腳 (機率掉落)", "!!! 等級100 !!! 在山洞內", "skull_blue", "rare_h_gg","119367"},
	[64006180]={ "36794", "希德洛斯", "等級540 皮甲 腳", "", "skull_grey", "rare_gg","118213"},
	[75604250]={ "37405", "鈦風", "原始之魂 + 頂尖水晶", "!!! 等級100 !!!", "skull_blue", "rare_h_gg","120945"},
	[63403070]={ "37372", "維諾拉希斯", "等級620 敏捷 匕首 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_gg","119395"},
    [42002500]={ "99999905", "重拳", "", "", "skull_orange", "mount_po", "116792"},
    [43205550]={ "99999905", "重拳", "", "", "skull_orange", "mount_po", "116792"},
    [45404750]={ "99999905", "重拳", "", "", "skull_orange", "mount_po", "116792"},
    [48805550]={ "99999905", "重拳", "", "", "skull_orange", "mount_po", "116792"},
    [51404310]={ "99999905", "重拳", "", "", "skull_orange", "mount_po", "116792"},
    [51623885]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [54004580]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [56004060]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [43403440]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
	[71304030]={ "37371", "艾卡利", "等級620 皮甲 手 (機率掉落)", "!!! 等級100 !!! 有三個刷新點", "skull_blue", "rare_h_gg","119361"},
	[56104070]={ "37371", "艾卡利", "等級620 皮甲 手 (機率掉落)", "!!! 等級100 !!! 有三個刷新點", "skull_blue", "rare_h_gg","119361"},
    [47504130]={ "39267", "忍者皮皮", "皮皮裝飾品", "", "default", "treasure_gg", "127867"},
}

nodes["Talador"] = {
	[36509610]={ "34182", "阿爾寇的家族寶藏", "等級557 弩", "需要先幫阿爾寇擊退敵人", "default", "treasure_td","117567"},
	[62083238]={ "34236", "紫水晶石", "100 要塞資源", "", "default", "treasure_td","116131"},
	[81843494]={ "34260", "阿盧納礦車", "礦石", "在礦坑的底層", "default", "treasure_td","109118"},
	[62414797]={ "34252", "魚桶", "", "", "default", "treasure_td","824"},
	[33297680]={ "34259", "噬骨者遺物", "金錢", "", "default", "treasure_td",""},
	[37607490]={ "34148", "噬骨者長矛", "等級566 鎖甲 手", "在山洞內; 需先擊敗維伯拉許並在他屍體上拾取", "default", "treasure_td","112371"},
	[73525137]={ "34471", "閃亮的金幣", "等級560 臨機應變 飾品 (攻擊觸發額外護甲值)", "在河底", "default", "treasure_td","116127"},
	[70100700]={ "36937", "燃刃儲物箱", "原始之魂 + 頂尖水晶", "!!! 等級100區域 !!!", "default", "treasure_td","120945"},
	[77044996]={ "34248", "焦黑的劍", "等級563 力量 雙手 劍", "", "default", "treasure_td","116116"},
	[66508694]={ "34239", "古怪的死網蛛蛋", "玩具", "在山洞內", "default", "treasure_td","117569"},
	[58901200]={ "33933", "迪賽西雅的悶燒長靴", "玩具", "", "default", "treasure_td","108743"},
	[55256671]={ "34253", "德萊尼武器", "100 要塞資源", "", "default", "treasure_td","116118"},
	[35419656]={ "34249", "農夫的獎賞", "金錢", "", "default", "treasure_td",""},
	[57362866]={ "34238", "工頭的午餐盒", "無增益效果的食物 (能重覆使用;只能在塔拉多爾使用)", "在鐵架上", "default", "treasure_td","116120"},
	[64587920]={ "34251", "鐵箱", "等級554 力量 單手 錘", "", "default", "treasure_td","117571"},
	[75003600]={ "33649", "鋼鐵斥候", "", "", "default", "treasure_td","824"},
	--[57207540]={ "34134", "Isaari's Cache", "i564 Agility Neck", "", "default", "treasure_td","117563"},(only Alliance can get it)
	[65471137]={ "34233", "一磹陳年鋼鐵酒", "酒精飲料", "", "default", "treasure_td","117568"},
	[75684140]={ "34261", "克魯的所有物", "金錢", "橋底的屍體旁", "default", "treasure_td",""},
	[53972769]={ "34290", "可緹雅的物品", "寵物", "在山洞內; 小心陷阱!", "default", "treasure_td","116402"},
	[38191242]={ "34258", "海洋之光", "金錢", "!!! 等級100區域 !!!", "default", "treasure_td",""},
	[68805620]={ "34101", "光明使者", "垃圾物品", "", "default", "treasure_td","109192"},
	[52562954]={ "34235", "夜光貝", "等級557 智力 頸部", "", "default", "treasure_td","116132"},
	[78211471]={ "34263", "純淨水晶粉末", "等級554 敏捷 戒指", "在礦坑的第二層", "default", "treasure_td","117572"},
	[75784472]={ "34250", "阿盧納聖物", "垃圾物品", "", "default", "treasure_td","116128"},
	[46969174]={ "34256", "泰爾莫聖物", "垃圾物品", "在底層的建築物裡", "default", "treasure_td","116128"},
	[64901330]={ "34232", "茹克的釣餌箱", "附魔: +4釣魚技能", "", "default", "treasure_td","116117"},
	[65968513]={ "34276", "生鏽的帶鎖箱", "金錢 + 裝綁綠裝", "在洞穴的水底內; 和納葛蘭的庫爾克洛什的寶藏(questID: 34760)的拾取紀錄有衝突,只能拾取其中之一,需要等待官方修復", "default", "treasure_td",""},
	[39505520]={ "34254", "縛魂者寶箱", "等級558 智力 戒指", "在萬魂庭的靈魂之墓內; 入口在東南邊 座標：41, 60", "default", "treasure_td","117570"},
	[39707810]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[39807670]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[39307770]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[51805930]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[52405770]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[54105630]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[54105960]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[70803200]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[70903550]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[72403700]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[72803560]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[73503070]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[74602930]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[74303400]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[74504570]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[75105420]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[75505210]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[75805500]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[76305120]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[77005230]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[78105100]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[78705210]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[78904960]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[79805140]={ "35162", "泰洛雄鷹巢", "寵物", "只能從泰洛雄鷹巢拾取一次", "default", "treasure_td","112699"},
	[38338450]={ "34257", "安格拉斯寶藏", "趣味物品", "", "default", "treasure_td","116119"},
	[65448860]={ "34255", "網覆之囊", "金錢", "在洞穴的的第二層", "default", "treasure_td",""},
	--[40608950]={ "34140", "Yuuri's Gift", "Garrison Resources", "", "default", "treasure_td","824"},(only Alliance can get it)
	[28397419]={ "36829", "先人的贈物", "等級563 智力 戒指", "在山洞內; 需把三尊雕像轉至面向中間才能拾取", "default", "treasure_td","118686"},
	[39304172]={ "34207", "冒泡的池子", "要塞資源 + 釣魚物品", "需要釣魚技能和水上行走; !!! 等級100區域 !!!", "default", "treasure_td","112623"},
	[46603520]={ "37338", "索奎薩爾的化身", "等級620 智力 副手物品 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_td","119378"},
	[44003800]={ "37339", "投彈手古戈克", "等級620 弩 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_td","119413"},
	[37407040]={ "34165", "『血肉撕裂者』克洛", "等級558 力量 單手 錘", "", "skull_grey", "rare_td","116123"},
	[68401570]={ "34142", "歿日博士", "趣味物品", "", "skull_grey", "rare_td","112499"},
	[34105720]={ "34221", "莫爾墨的回聲", "玩具", "要殺死所有暗影議會召喚者才能攻擊", "skull_green", "rare_td","113670"},
	[50808380]={ "35018", "魔化硬木", "等級554 智力 盾牌", "", "skull_grey", "rare_td","112373"},
	[47603290]={ "37341", "魔焰之后", "等級620 敏捷 戒指 (機率掉落)", "!!! 等級101 !!!", "skull_blue", "rare_h_td","119386"},
	[46205480]={ "34145", "狂亂的魔像", "等級563 敏捷/力量 單手 劍", "", "skull_grey", "rare_td","113287"},
	[67408030]={ "34929", "格納迪恩", "等級558 敏捷 飾品 (攻擊觸發精通)", "", "skull_grey", "rare_td","116075"},
	[31806380]={ "34189", "微光之翼", "使用後能夠短暫沖前", "", "skull_grey", "rare_td","116113"},
	[22207400]={ "36919", "戈博格爾", "等級588 皮甲 腰部", "點擊騷動的箱子召喚", "skull_grey", "rare_td","120436"},
	[47503930]={ "37340", "古格托爾", "等級620 智力 單手 劍 (機率掉落)", "!!! 等級101 !!! 在底層的建築物裡", "skull_blue", "rare_h_td","119402"},
	[48102520]={ "37312", "『盡噬者』赫昆", "等級620 力量 單手 劍 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_td","119403"},
	[62004600]={ "34185", "鎚齒", "等級558 鎖甲 胸部", "", "skull_grey", "rare_td","116124"},
	[78005040]={ "34167", "禽母哈米", "等級556 智力 背部", "", "skull_grey", "rare_td","112369"},
	[56606360]={ "35219", "『凱旋者』卡拉佐斯 + 葛佐瑪爾 + 『屠殺仕女』賽克西絲", "玩具", "三個怪物同一掉落;只能拾取一次", "skull_green", "rare_td","116122"},
	[66708530]={ "34498", "克里奇斯", "玩具", "在洞穴的的第二層", "skull_green", "rare_td","116125"},
	[37503750]={ "37348", "庫爾洛什‧滅牙", "等級620 敏捷 匕首 (機率掉落)", "!!! 等級102 !!! 在建築物的露台", "skull_blue", "rare_h_td","119394"},
	[33503790]={ "37346", "丹萊許女士", "等級620 布甲 長袍 (機率掉落)", "!!! 等級102 !!! 在建築物的露台", "skull_blue", "rare_h_td","119352"},
	[38002080]={ "37342", "軍團先鋒", "等級620 鎧甲 手腕 (機率掉落)", "!!! 等級101 !!! 先擊敗10個議會魂語者,再擊敗3次來自傳送門的惡魔就會出現", "skull_blue", "rare_h_td","119385"},
	[49209230]={ "34208", "洛瑪格·碎顎者", "等級558 力量 頸部", "", "skull_grey", "rare_td","116070"},
	[30902670]={ "37345", "領主寇里納克", "等級620 力量 戒指 (機率掉落)", "!!! 等級102 !!!", "skull_blue", "rare_h_td","119388"},
	[38704980]={ "37349", "罪惡女族長", "等級620 布甲 手 (機率掉落)", "!!! 等級102 !!!", "skull_blue", "rare_h_td","119353"},
	[86403040]={ "34859", "諾羅許", "等級558 臨機應變 飾品 (攻擊觸發智力)", "", "skull_grey", "rare_td","116077"},
	[31404750]={ "37344", "『觀察者』歐魯莫", "等級620 智力 頸部 (機率掉落) + 寵物 (低機率掉落)", "!!! 等級102 !!! 需要有5名玩家同時站在淺綠色的符文上才能攻擊", "skull_green", "rare_h_td","119375"},
	[59505990]={ "34196", "拉坎", "等級563 敏捷 拳套", "在山洞內", "skull_grey", "rare_td","116112"},
	[41004200]={ "37347", "暗焰懼行者", "等級620 力量 單手 斧 (機率掉落)", "!!! 等級102 !!!", "skull_blue", "rare_h_td","119393"},
	[43005400]={ "34671", "舍茲爾", "等級554 皮甲 腳", "在萬魂庭的靈魂之墓內; 入口在西南邊 座標：41, 60", "skull_grey", "rare_td","112370"},
	[67703580]={ "36858", "鋼牙", "等級559 敏捷 長柄武器", "", "skull_grey", "rare_td","117562"},
	[46002740]={ "37337", "戰略家安寇爾 + 大魔導師泰珈 + 縛魂者奈菈娜", "等級620 智力 背部 (機率掉落)", "!!! 等級101 !!! 三個稀有共享掉落,必須全部打敗才能拾取", "skull_blue", "rare_h_td","119350"},
	[59008770]={ "34171", "塔拉多爾狼蛛", "等級565 敏捷 單手 劍", "需要一直踩小蜘蛛來召喚他", "skull_grey", "rare_td","116126"},
	[53809130]={ "34668", "魔爪祭司佐克拉", "等級560 布甲 頭部; 穿上去會使佐克拉之殞的破碎之手獸人變成惡魔", "", "skull_grey", "rare_td","116110"},
	[63802070]={ "34945", "透視者血鬃", "等級554 力量 戒指", "在底層的建築物裡", "skull_grey", "rare_td","112475"},
	[36804100]={ "37350", "警戒的帕索斯", "等級620 鎧甲 肩部 (機率掉落)", "!!! 等級102 !!!", "skull_blue", "rare_h_td","119383"},
	[69603340]={ "34205", "遊蕩的復仇者", "等級554 力量 單手 劍", "擊殺後點擊希望拾取物品", "skull_grey", "rare_td","112261"},
	[37601460]={ "37343", "『毀滅者』索薩亞", "等級620 鎖甲 肩部 (機率掉落) + 趣味物品 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_td","119371"},
	[53802570]={ "34135", "『焚化者』亞芝菈", "等級554 鎖甲 手腕", "", "skull_grey", "rare_td","112263"},
    [55008100]={ "99999907", "辛爾特海德", "", "", "skull_orange", "mount_si", "116767"},
    [62003260]={ "99999907", "辛爾特海德", "", "", "skull_orange", "mount_si", "116767"},
    [62404560]={ "99999907", "辛爾特海德", "", "", "skull_orange", "mount_si", "116767"},
    [67405900]={ "99999907", "辛爾特海德", "", "", "skull_orange", "mount_si", "116767"},
    [79005540]={ "99999907", "辛爾特海德", "", "", "skull_orange", "mount_si", "116767"},
    [39905560]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [47204890]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [46305260]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [52204110]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [52302590]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [51006330]={ "39266", "騎士皮皮", "皮皮裝飾品", "", "default", "treasure_td", "127869"},
}

nodes["SpiresOfArak"] = {
	[40595497]={ "36458", "被遺棄的採礦鎬", "等級578 力量 單手 斧", "可加快在德拉諾的採礦速度,不需要裝備", "default", "treasure_soa","116913"},
	[36195446]={ "36462", "泰勒上將的箱子", "", "需要一把舊鎖匙", "default", "treasure_soa","824"},
	[37705640]={ "36462", "一把舊鎖匙", "用來打開泰勒上將的箱子", "", "default", "treasure_soa","116020"},
	[49203721]={ "36445", "刺客長矛", "等級580 敏捷 長柄武器", "", "default", "treasure_soa","116835"},
	[55539086]={ "36367", "戰役貢品", "金錢", "在門上的架子; 需要跳躍技巧", "default", "treasure_soa",""},
	[68428898]={ "36453", "拗幣者的酬勞", "金錢", "", "default", "treasure_soa",""},
	[36585791]={ "36418", "埃菲艾爾的闇黑魔典", "等級579 智力 副手物品", "", "default", "treasure_soa","116914"},
	[50502210]={ "36246", "破裂的日長石", "垃圾物品", "", "default", "treasure_soa","116919"},
	[37154750]={ "36420", "要塞補給品", "", "", "default", "treasure_soa","824"},
	[41855042]={ "36451", "要塞工人之錘", "等級580 力量 單手 錘", "", "default", "treasure_soa","116918"},
	[48604450]={ "36386", "安祖的贈禮", "等級585 弩", "需先在泰洛克聖壇飲附近用暗影視界藥劑才能拾取", "default", "treasure_soa","118237"},
	[57007900]={ "36390", "安祖的贈禮", "等級585 智力 單手 劍", "需先在泰洛克聖壇飲附近用暗影視界藥劑才能拾取", "default", "treasure_soa","118241"},
	[46954044]={ "36389", "安祖的贈禮", "等級585 敏捷/力量 長柄武器", "需先在泰洛克聖壇飲附近用暗影視界藥劑才能拾取", "default", "treasure_soa","118238"},
	[52031958]={ "36392", "安祖的贈禮", "等級585 智力 法杖", "需先在泰洛克聖壇飲附近用暗影視界藥劑才能拾取", "default", "treasure_soa","118239"},
	[42402670]={ "36388", "安祖的贈禮", "等級585 魔杖", "需先在泰洛克聖壇飲附近用暗影視界藥劑才能拾取", "default", "treasure_soa","118242"},
	[61105537]={ "36381", "安祖的贈禮", "等級585 敏捷/力量 單手 劍", "需先在泰洛克聖壇飲附近用暗影視界藥劑才能拾取", "default", "treasure_soa","118240"},
	[50332579]={ "36444", "鋼鐵部落炸藥", "垃圾物品; 物品放在身上一段時間後會把你炸飛", "", "default", "treasure_soa","118691"},
	[50782874]={ "36247", "遺失的草藥袋", "隨機德拉諾草藥", "在橋底", "default", "treasure_soa","109124"},
	[47773612]={ "36411", "遺失的戒指", "等級578 智力 戒指", "", "default", "treasure_soa","116911"},
	[52474280]={ "36416", "不該出現的卷軸", "考古學碎片", "需要考古學技能; 在山上,上山座標：54, 48", "default", "treasure_soa_a","829"},
	[42691832]={ "36244", "不該出現的卷軸", "考古學碎片", "需要考古學技能", "default", "treasure_soa_a","829"},
	[63586737]={ "36454", "神秘的蘑菇", "草藥", "在山上", "default", "treasure_soa","109127"},
	[60808780]={ "35481", "尼希斯的箱子", "", "點擊逃生艙並等待尼希斯‧偏火的對話完成就能拾取", "default", "treasure_soa","824"},
	[53315552]={ "36403", "獻給鴉母的祭品", "增加5%充份休息經驗", "", "default", "treasure_soa","118267"},
	[48355261]={ "36405", "獻給鴉母的祭品", "增加5%充份休息經驗", "", "default", "treasure_soa","118267"},
	[48905470]={ "36406", "獻給鴉母的祭品", "增加5%充份休息經驗", "", "default", "treasure_soa","118267"},
	[51886465]={ "36407", "獻給鴉母的祭品", "增加5%充份休息經驗", "", "default", "treasure_soa","118267"},
	[60976387]={ "36410", "獻給鴉母的祭品", "增加5%充份休息經驗", "", "default", "treasure_soa","118267"},
	[58706024]={ "36340", "歐格隆的財寶", "垃圾物品", "", "default", "treasure_soa","116921"},
	[36283934]={ "36402", "獸人通訊號角", "等級577 雙擊 飾品 (攻擊觸發力量)", "", "default", "treasure_soa","120337"},
	[36821716]={ "36243", "流亡者的物品", "金錢 + 裝綁綠裝", "", "default", "treasure_soa",""},
	[42172168]={ "36447", "流亡者的物品", "金錢 + 裝綁綠裝", "", "default", "treasure_soa",""},
	[46903406]={ "36446", "流亡者的錢包", "金錢 + 裝綁綠裝", "在樹上的鴉人身上", "default", "treasure_soa",""},
	[42961637]={ "36245", "流亡者古物", "考古學碎片", "需要考古學技能和跳躍技巧", "default", "treasure_soa_a","829"},
	[45964415]={ "36354", "流亡者古物", "考古學碎片", "需要考古學技能和跳躍技巧", "default", "treasure_soa_a","829"},
	[43162726]={ "36355", "流亡者古物", "考古學碎片", "需要考古學技能和跳躍技巧", "default", "treasure_soa_a","829"},
	[67373983]={ "36356", "流亡者古物", "考古學碎片", "需要考古學技能和跳躍技巧", "default", "treasure_soa_a","829"},
	[60215391]={ "36359", "流亡者古物", "考古學碎片", "需要考古學技能和跳躍技巧", "default", "treasure_soa_a","829"},
	[51894892]={ "36360", "流亡者古物", "考古學碎片", "需要考古學技能和跳躍技巧", "default", "treasure_soa_a","829"},
	[37375056]={ "36657", "小魯比的便便", "等級581 力量 頸部", "要先對旅店的小魯比使用3次魯比瑞(旅店的廚師出售)", "default", "treasure_soa","116887"},
	[44331204]={ "36377", "魯克馬爾的塑像", "垃圾物品", "同時提供5%力量、智力和敏捷的增益效果(持續30分鐘)", "default", "treasure_soa","118693"},
	[59179064]={ "36366", "水手沙祖克的90度蘭姆酒", "酒精飲料", "", "default", "treasure_soa","116917"},
	[68333893]={ "36375", "塞司克塑像", "垃圾物品", "同時提供5%力量、智力和敏捷的增益效果(持續30分鐘)", "default", "treasure_soa","118692"},
	[71644859]={ "36450", "塞司克儀式酒", "治療藥水 + 酒精飲料", "", "default", "treasure_soa","109223"},
	[56232881]={ "36362", "破碎之手儲物箱", "", "", "default", "treasure_soa","824"},
	[47923065]={ "36361", "破碎之手帶鎖箱", "帶鎖箱 (需盜賊技能開啟)", "", "default", "treasure_soa","116920"},
	[60868461]={ "36456", "伐木機零件", "", "", "default", "treasure_soa","824"},
	[56294531]={ "36433", "走私的頂尖文物", "考古學碎片", "在樹幹上;需要考古學技能和跳躍技巧", "default", "treasure_soa_a","829"},
	[59638134]={ "36365", "灑器5000XT", "", "", "default", "treasure_soa","824"},
	[34142751]={ "36421", "日觸寶箱", "", "需要跳躍技巧", "default", "treasure_soa","824"},
	[33292727]={ "36422", "日觸寶箱", "考古學碎片", "需要考古學技能和跳躍技巧", "default", "treasure_soa_a","829"},
	[54353255]={ "36364", "毒牙毒液", "100 要塞資源", "", "default", "treasure_soa","118695"},
	[66475653]={ "36455", "浸水的袋子", "金錢 + 裝綁綠裝", "在水底", "default", "treasure_soa",""},
	[57802220]={ "36374", "安祖之像", "垃圾物品", "在山上,上山座標：56, 25 ;同時提供5%力量、智力和敏捷的增益效果(持續30分鐘)", "default", "treasure_soa","118694"},
	[58308440]={ "36291", "蓓琪‧轟籃", "等級583 槍械", "", "skull_grey", "rare_soa","116907"},
	[46802320]={ "35599", "刃舞者艾瑞克斯", "垃圾物品", "", "skull_grey", "rare_soa","116839"},
	[64006480]={ "36283", "荒疫之光", "等級586 皮甲 肩部", "", "skull_grey", "rare_soa","118205"},
	[46402860]={ "36267", "德卡茲‧鋼喉", "等級586 鎖甲 腳", "", "skull_grey", "rare_soa","118198"},
	[69305390]={ "37406", "艾奇多納", "原始之魂 + 頂尖水晶", "!!! 等級100 !!!", "skull_blue", "rare_h_soa","120945"},
	[54803960]={ "36297", "膿卉", "等級584 智力 副手物品", "", "skull_grey", "rare_soa","118200"},
	[24902560]={ "36943", "凝視", "等級565 智力 戒指", "點擊惡魔寶典召喚", "skull_grey", "rare_soa","118696"},
	[74704330]={ "37390", "貪吃的巨人", "等級620 魔杖 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_soa","119404"},
	[33405890]={ "36305", "噬鰭", "垃圾物品", "", "skull_grey", "rare_soa","116836"},
	[59301480]={ "36887", "蒼絨隱士", "等級582 布甲 頭部", "", "skull_grey", "rare_soa","118279"},
	[56509480]={ "36306", "『孢子吞食者』加斯卡", "等級589 加速 飾品 (攻擊觸發智力)", "", "skull_grey", "rare_soa","118202"},
	[62803740]={ "36268", "『浴血者』卡洛斯", "等級588 布甲 長袍", "", "skull_grey", "rare_soa","118735"},
	[53208900]={ "36396", "穆塔芬", "等級589 力量 雙手 錘", "", "skull_grey", "rare_soa","118206"},
	[36305260]={ "36129", "納斯‧敦柏林", "等級578  敏捷/力量 長柄武器", "", "skull_grey", "rare_soa","116837"},
	[65005410]={ "36288", "『復仇者』歐斯其拉", "等級589 敏捷 匕首", "", "skull_grey", "rare_soa","118204"},
	[59503750]={ "36279", "毒刃大師波塔斯克", "等級583 雙擊 飾品 (使用後做成傷害)", "", "skull_grey", "rare_soa","118199"},
	[38402780]={ "36470", "腐頂", "寵物", "", "skull_green", "rare_soa","118107"},
	[68804890]={ "36276", "桑里卡斯", "等級589 皮甲 胸部", "需先打斷塞司克馴蛇者才會出現", "skull_grey", "rare_soa","118203"},
	[71303320]={ "37392", "暗影巨怪", "等級620 皮甲 腿部 (機率掉落)", "!!! 等級100 !!! 在山洞內; 入口座標：73,34", "skull_blue", "rare_h_soa","119363"},
	[52103560]={ "36478", "影皮", "等級579 智力 盾牌", "", "skull_grey", "rare_soa","118201"},
	[52000730]={ "37394", "太陽加持者", "等級620 智力 長柄武器 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_soa","119407"},
	[33502190]={ "36265", "石惡", "等級577 鎖甲 腿部", "", "skull_grey", "rare_soa","116858"},
	[59104520]={ "36298", "裂棘", "等級578 敏捷 單手 劍", "需要一直殺死蜜蜂來召喚他", "skull_grey", "rare_soa","116855"},
	[52905500]={ "36472", "蟲葉", "等級582 智力 法杖", "", "skull_grey", "rare_soa","116857"},
	[54606320]={ "36278", "裂爪者", "等級578 敏捷 頸部", "在山上,上山座標：54, 59", "skull_grey", "rare_soa","116838"},
	[57307410]={ "36254", "『斷翼者』泰斯卡", "等級578 智力 頸部", "", "skull_grey", "rare_soa","116852"},
	[72101950]={ "37360", "無形夢魘", "等級620 鎖甲 手腕 (機率掉落)", "!!! 等級102 !!! 需通過虛無傳送門", "skull_blue", "rare_h_soa","119373"},
	[71604490]={ "37393", "超能哨兵", "等級620 敏捷 單手 劍 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_soa","119401"},
	[70502410]={ "37361", "『排除者』克諾斯", "等級620 布甲 頭部 (機率掉落)", "!!! 等級100 !!! 需通過虛無傳送門; 需要3名玩家同時點擊虛無之觸符文石召喚", "skull_blue", "rare_h_soa","119354"},
	[74413864]={ "37391", "機械盜掠者", "等級620 敏捷 單手 錘 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_soa","119398"},
	[72601930]={ "37358", "曲魂師托雷克", "等級620 智力 法杖 (機率掉落) + 玩具 (低機率掉落)", "!!! 等級100 !!!", "skull_green", "rare_h_soa","119410"},
	[72903090]={ "37359", "虛無劫奪者烏爾妮", "等級20 敏捷 單手 斧 (機率掉落)", "!!! 等級100 !!!", "skull_blue", "rare_h_soa","119392"},
	[72702460]={ "37357", "馬爾格許‧守影", "等級620 鎖甲 頭部 (機率掉落)", "!!! 等級100 !!! 在山洞內; 入口座標：29,52", "hundredrare", "SMVHundred","119369"},
	[29404160]={ "35334", "瓦拉夏", "寵物", "在山洞內; 入口座標：31,43; 先點擊瓦拉夏之蛋召喚瓦拉夏，擊殺後才能拾取瓦拉夏之蛋", "default", "treasure_soa","118207"},
    [36401830]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [46842018]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [50500630]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [60801123]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [54108360]={ "39268", "海盜皮皮", "皮皮裝飾品", "", "default", "treasure_soa", "127870"},
}

nodes["NagrandDraenor"] = {
	[73071080]={ "35951", "一坨泥土", "", "在山崖上", "default", "treasure_ng","824"},
	[67655971]={ "35759", "被遺棄的貨物", "裝綁綠裝", "", "default", "treasure_ng",""},
	[38404940]={ "36711", "阿布加爾最愛的釣餌", "追隨者道具(阿布加爾)", "收集3件阿布加爾的道具交給阿布加爾來獲得這個追隨者 (泰拉的北邊山崖下 座標:67, 56); 當你獲得此追隨者後,此標記會從地圖上移除", "default", "treasure_ng","114245"},
	[85403870]={ "36711", "阿布加爾遺失的捲線器", "追隨者道具(阿布加爾)", "收集3件阿布加爾的道具交給阿布加爾來獲得這個追隨者 (泰拉的北邊山崖下 座標:67, 56); 當你獲得此追隨者後,此標記會從地圖上移除", "default", "treasure_ng","114243"},
	[65906120]={ "36711", "阿布加爾的活力", "追隨者道具(阿布加爾)", "收集3件阿布加爾的道具交給阿布加爾來獲得這個追隨者 (泰拉的北邊山崖下 座標:67, 56); 當你獲得此追隨者後,此標記會從地圖上移除", "default", "treasure_ng","114242"},
	[75816203]={ "36077", "冒險者的釘錘", "金錢 + 裝綁綠色 單手 錘", "", "default", "treasure_ng",""},
	[82275660]={ "35765", "冒險者的包包", "金錢 + 裝綁綠裝", "", "default", "treasure_ng",""},
	[45635200]={ "35969", "冒險者的包包", "金錢 + 裝綁綠裝", "", "default", "treasure_ng",""},
	[69955244]={ "35597", "冒險者的包包", "金錢 + 裝綁綠裝", "山崖的樹上", "default", "treasure_ng",""},
	[56567294]={ "36050", "冒險者的小包", "金錢 + 裝綁綠裝", "在懸崖上; 需要從山上跳下來", "default", "treasure_ng",""},
	[73931405]={ "35955", "冒險者的袋子", "金錢 + 裝綁綠裝", "在瀑布底", "default", "treasure_ng",""},
	[81461307]={ "35953", "冒險者的法杖", "等級593 裝綁綠色 智力 法杖", "在懸崖上", "default", "treasure_ng","116640"},
	[73057554]={ "35673", "被偷走的戰歌氏族補給品", "", "在山崖上; 使用熱砂滑翔裝置 (探險者緹娜)到達這裡 [東北方]", "default", "treasure_ng","824"},
	[62546708]={ "36116", "一袋藥草", "隨機草藥", "", "default", "treasure_ng","109124"},
	[77312807]={ "35986", "骨雕匕首", "等級597 敏捷 匕首", "在山崖上", "default", "treasure_ng","116760"},
	[77081662]={ "36174", "元素的獎賞", "", "在山上的洞穴內; 需要從瀑布旁的小徑(座標：76, 15)上去; 需先依次序點風>地>水>火圖騰才能拾取", "default", "treasure_ng","824"},
	[81083725]={ "35661", "明亮的夢境花", "藥劑", "在山崖上; 使用熱砂滑翔裝置 (探險者倫佐)到達這裡 [東北方]", "default", "treasure_ng","118262"},
	[85415347]={ "35696", "燃刃儲物箱", "裝綁綠裝", "需要從旁邊山上跳過來", "default", "treasure_ng",""},
	[66961949]={ "35954", "元素祭品", "垃圾物品", "在山崖上", "default", "treasure_ng","118234"},
	[78901556]={ "36036", "元素鐐銬", "等級605 敏捷 戒指", "在山崖上,需從旁邊山崖上跳過來", "default", "treasure_ng","118251"},
	--[53407320]={ "900003", "Explorer Bibsi", "Nothing", "You need to use a rocket to get to her [south-east of her position]", "glider", "treasure_ng",""},
	--[67601420]={ "900004", "Explorer Dez", "Nothing", "You can reach him from the east starting at the elemental plateau", "glider", "treasure_ng",""},
	--[87204100]={ "900005", "Explorer Garix", "Nothing", "Is required for 2 Treasures [1 south, 1 south-east]", "glider", "treasure_ng",""},
	--[75606460]={ "900006", "Explorer Razzuk", "Nothing", "Is required for some other Treasures", "glider", "treasure_ng",""},
	--[83803380]={ "900007", "Explorer Renzo", "Nothing", "Is required for 3 Treasures [2 north-east, 1 south-west]", "glider", "treasure_ng",""},
	[45866629]={ "36020", "歐夏剛碎片", "等級607 智力 盾牌", "", "default", "treasure_ng","117981"},
	[73052153]={ "35692", "清水蚌", "垃圾物品", "在水底", "default", "treasure_ng","118233"},
	[88901824]={ "35660", "真菌覆蓋的箱子", "", "在蘑菇頂部; 使用熱砂滑翔裝置 (探險者倫佐)到達這裡 [西南方]", "default", "treasure_ng","824"},
	[75374711]={ "36074", "賭徒的錢包", "趣味物品", "", "default", "treasure_ng","118236"},
	[43225755]={ "35987", "真諾達號殘骸", "", "", "default", "treasure_ng","824"},
	[48066011]={ "35999", "真諾達號殘骸", "", "", "default", "treasure_ng","824"},
	[48587279]={ "36008", "真諾達號殘骸", "", "", "default", "treasure_ng","824"},
	[44696757]={ "36002", "真諾達號殘骸", "", "", "default", "treasure_ng","824"},
	[55356828]={ "36011", "真諾達號殘骸", "", "", "default", "treasure_ng","824"},
	[72976212]={ "35590", "哥布林背包", "", "在懸崖中間(石橋下方); 使用熱砂滑翔裝置 (探險者拉茲克)到達這裡 [東南方]", "default", "treasure_ng","824"},
	[47207425]={ "35576", "哥布林背包", "", "在樹上; 使用熱砂滑翔裝置 (探險者碧絲比)到達這裡 [東方]", "default", "treasure_ng","824"},
	[58285249]={ "35694", "黃金卡里瑞蛋", "垃圾物品", "樹上的巢", "default", "treasure_ng","118266"},
	[38345872]={ "36109", "金趾搶來的財寶", "金錢", "鎖匙在旁邊的鸚鵡身上", "default", "treasure_ng",""},
	[87107288]={ "36051", "灰喉的骨堆", "趣味物品 - 寵物玩具", "", "default", "treasure_ng","118054"},
	[87624498]={ "35622", "隱密藏匿物", "", "在樹上; 使用熱砂滑翔裝置 (探險者賈里斯)到達這裡 [北方]", "default", "treasure_ng","824"},
	[67384906]={ "36039", "天槌巨錘", "等級605 力量 戒指", "在山崖上", "default", "treasure_ng","118252"},
	[75236563]={ "36099", "重要的探索補給", "酒精飲料", "在山上的洞穴", "default", "treasure_ng","61986"},
	[61765747]={ "36082", "遺失的墜飾", "等級593 裝綁綠色 頸部", "", "default", "treasure_ng","116687"},
	[70531385]={ "35643", "登山者背包", "", "在懸崖中間; 使用熱砂滑翔裝置 (探險者黛茲)到達這裡 [西方]", "default", "treasure_ng","824"},
	[80967979]={ "36049", "巨魔串珠", "等級605 力量 戒指", "", "default", "treasure_ng","118255"},
	[57796205]={ "36115", "蒼白藥劑", "藥劑", "在山崖上", "default", "treasure_ng","118278"},
	[58295931]={ "36021", "波克哈爾的第十三把斧頭", "等級605 力量 單手 斧", "在樹上,需要從山崖跳下去", "default", "treasure_ng","116688"},
	[72716092]={ "36035", "拋光劍齒人顱骨", "等級605 敏捷/力量 戒指", "在山崖上", "default", "treasure_ng","118254"},
	--[58507630]={ "900008", "Rocket to Explorer Bibsi", "Nothing", "Is required to get to Explorer Bibsi", "rocket", "treasure_ng",""},
	[75186494]={ "36102", "劍齒人儲物箱", "金錢 + 裝綁綠裝", "在山崖上", "default", "treasure_ng",""},
	[89073313]={ "36857", "走私者寶箱", "", "在山洞內; 小心陷阱!", "default", "treasure_ng","824"},
	[40346864]={ "37435", "靈魂法櫃", "", "在山洞內; 入口在東邊(座標:42, 68)", "default", "treasure_ng","824"},
	[50128228]={ "35577", "熱砂補給物資", "", "在懸崖上; 使用熱砂滑翔裝置 (探險者碧絲比)到達這裡 [東北方]", "default", "treasure_ng","824"},
	[52678008]={ "35583", "熱砂補給物資", "", "在懸崖上; 使用熱砂滑翔裝置 (探險者碧絲比)到達這裡 [北方]", "default", "treasure_ng","824"},
	[77835195]={ "35591", "熱砂補給物資", "", "在競技場的頂部; 使用熱砂滑翔裝置 (探險者拉茲克)到達這裡 [南方]", "default", "treasure_ng","824"},
	[64591762]={ "35648", "熱砂補給物資", "", "在山崖上; 使用熱砂滑翔裝置 (探險者黛茲)到達這裡 [東北方]", "default", "treasure_ng","824"},
	[70601860]={ "35646", "熱砂補給物資", "", "在石拱的頂部; 使用熱砂滑翔裝置 (探險者黛茲)到達這裡 [西北方]", "default", "treasure_ng","824"},
	[87602028]={ "35662", "熱砂補給物資", "", "在蘑菇頂部; 使用熱砂滑翔裝置 (探險者倫佐)到達這裡 [西南方]", "default", "treasure_ng","824"},
	[88274262]={ "35616", "熱砂補給物資", "", "在山崖上; 使用熱砂滑翔裝置 (探險者賈里斯)到達這裡 [西北方]", "default", "treasure_ng","824"},
	[64716583]={ "36046", "泰拉防衛者之盾", "等級605 敏捷/智力 戒指", "", "default", "treasure_ng","118253"},
	[37717065]={ "34760", "庫爾克洛什的寶藏", "", "在建築物的底層; 和塔拉多爾的生鏽的帶鎖箱(questID: 34276)的拾取紀錄有衝突,只能拾取其中之一,需要等待官方修復", "default", "treasure_ng","824"},
	[49976651]={ "35579", "虛無灌注水晶", "等級613 力量 雙手 劍", "在歐夏剛上; 使用熱砂滑翔裝置 (探險者碧絲比)到達這裡 [東南方]", "default", "treasure_ng","118264"},
	[51726029]={ "35695", "戰歌儲物箱", "", "", "default", "treasure_ng","824"},
	[52414438]={ "36073", "戰歌頭盔", "等級609 鎖甲 頭部", "", "default", "treasure_ng","118250"},
	[73047036]={ "35678", "戰歌帶鎖箱", "", "在塔頂; 使用熱砂滑翔裝置 (探險者緹娜)到達這裡 [東南方]", "default", "treasure_ng","824"},
	[76066990]={ "35682", "戰歌之矛", "垃圾物品", "在懸崖中間(石橋下方); 使用熱砂滑翔裝置 (探險者緹娜)到達這裡 [南方]", "default", "treasure_ng","118678"},
	[80656054]={ "35593", "戰歌戰利品", "", "在塔頂; 使用熱砂滑翔裝置 (探險者拉茲克)到達這裡 [西方]", "default", "treasure_ng","824"},
	[89406588]={ "35976", "戰歌氏族的補給品", "", "", "default", "treasure_ng","824"},
	[64763573]={ "36071", "防水袋", "20格背包", "在橋底", "default", "treasure_ng","118235"},
	[53386425]={ "36088", "冒險者的小包", "金錢 + 裝綁綠裝", "在山洞內; 入口在東邊(座標:56, 62)", "default", "treasure_ng",""},
	[35475725]={ "36846", "靈魂贈禮", "", "在山上; 從戈爾瑪許‧地獄吼後方的小路上山; 點擊所有被遺忘的火盆才能拾取", "default", "treasure_ng","824"},
	[84605340]={ "35778", "大劍師先祖", "等級598 力量 頸部", "點擊大劍師的劍召喚", "skull_grey", "rare_ng","116832"},
	[51001600]={ "37210", "奧格克森", "把它交給賈茲莫夫‧牛仔(洛克拉斯的西邊 座標:50, 41)來獲取500點熱砂保護協會聲望", "", "swprare", "rare_s_ng","118654"},
	[62601680]={ "37211", "伯格魯", "把它交給賈茲莫夫‧牛仔(洛克拉斯的西邊 座標:50, 41)來獲取500點熱砂保護協會聲望", "", "swprare", "rare_s_ng","118655"},
	[76506450]={ "35735", "強力T300型二代伐木機", "等級598 雙擊 飾品 (治療觸發智力)", "在山洞內; 點擊哥布林炸藥引爆裝置召喚它", "skull_grey", "rare_ng","116823"},
	[40001600]={ "37396", "斷骨者", "等級620 鎖甲 腿部 (機率掉落)", "", "skull_blue", "rare_h_ng","119370"},
	[43003640]={ "37400", "布魯塔格‧厲刀", "等級620 鎧甲 腳 (機率掉落)", "", "skull_blue", "rare_h_ng","119380"},
	[34307690]={ "34727", "鐵鬚船長", "等級607 槍械 + 玩具", "這個稀有會每日重置拾取,需要等待官方修復", "skull_green", "rare_ng","116809"},
	[64203000]={ "37221", "德克漢", "把它交給賈茲莫夫‧牛仔(洛克拉斯的西邊 座標:50, 41)來獲取500點熱砂保護協會聲望", "", "swprare", "rare_s_ng","118656"},
	[60003800]={ "37222", "厄蹄", "把它交給賈茲莫夫‧牛仔(洛克拉斯的西邊 座標:50, 41)來獲取500點熱砂保護協會聲望", "", "swprare", "rare_s_ng","118657"},
	[38602240]={ "37395", "杜格‧碎脊者", "等級620 敏捷 雙手 錘 (機率掉落)", "", "skull_blue", "rare_h_ng","119405"},
	[89004100]={ "35623", "探險者諾贊德", "垃圾物品", "在瀑布後; 使用熱砂滑翔裝置 (探險者賈里斯)到達這裡 [西方]", "skull_grey", "rare_ng","118679"},
	[75301090]={ "35836", "碎擊蠻魚", "垃圾物品", "點擊被遺棄的釣竿召喚", "skull_grey", "rare_ng","116836"},
	[70004180]={ "35893", "燧革", "等級609 力量 盾牌", "", "skull_grey", "rare_ng","116807"},
	[48202220]={ "37223", "『殘暴者』加葛洛格", "把它交給賈茲莫夫‧牛仔(洛克拉斯的西邊 座標:50, 41)來獲取500點熱砂保護協會聲望", "", "swprare", "rare_s_ng","118658"},
	[52505580]={ "35715", "珈露亞", "等級605 雙擊 飾品 (攻擊召喚狼守護者)", "", "skull_grey", "rare_ng","118246"},
	[43807770]={ "34725", "賈茲沃達", "等級602 智力 戒指", "在山洞內", "skull_grey", "rare_ng","116798"},
	[66705630]={ "35717", "狂暴的瘤蹄", "等級598 雙擊 飾品 (攻擊觸發敏捷)", "", "skull_grey", "rare_ng","116824"},
	[93102840]={ "35898", "凝血瓣", "等級602 皮甲 手 ;可加快在德拉諾的採草速度,不需要裝備", "在海邊的山洞內; 點擊原始百合召喚", "skull_grey", "rare_ng","116916"},
	[42603630]={ "37472", "戈爾塔格‧鋼柄", "原始之魂 + 頂尖水晶", "先從莫克戈爾獸群領袖身上獲得秘密會議資料,再用信標號角召喚(座標: 42, 36; 門邊)召喚", "skull_blue", "rare_h_ng","120945"},
	[84203680]={ "36159", "礫齒", "等級609 皮甲 手腕", "一直殺死貪噬嚼岩戈倫就會出現", "skull_grey", "rare_ng","118689"},
	[66705130]={ "35714", "鴻羽", "等級600 布甲 長袍", "在山崖上", "skull_grey", "rare_ng","116795"},
	[89507280]={ "35784", "灰喉", "等級610 力量 背部", "", "skull_grey", "rare_ng","118687"},
	[80603040]={ "35923", "獵人黑齒", "等級609 敏捷 雙手 錘", "在山崖上", "skull_grey", "rare_ng","118245"},
	[87005500]={ "34862", "海沛利恩斯", "等級597 加速 飾品 (攻擊觸發精通)", "點擊3個召喚火盆召喚", "skull_grey", "rare_ng","116799"},
	[45803480]={ "37399", "卡洛許‧黑風", "等級620 布甲 腿部 (機率掉落)", "", "skull_blue", "rare_h_ng","119355"},
	[42603630]={ "37473", "克拉爾‧亡眼", "原始之魂 + 頂尖水晶", "先從莫克戈爾獸群領袖身上獲得秘密會議資料,再用信標號角召喚(座標: 42, 36; 門邊)召喚", "skull_blue", "rare_h_ng","120945"},
	[58201200]={ "37398", "『剔骨者』克魯德", "等級620 鎧甲 腰部 (機率掉落) + 染血的入場券 (低機率掉落) + 成就", "需要先殺死戈利安試煉場巨魔才能攻擊(有時間限制)", "skull_blue", "rare_h_ng","119384"},
	[52309010]={ "37408", "勒奈亞", "原始之魂 + 頂尖水晶", "", "skull_blue", "rare_h_ng","120945"},
	[81206000]={ "35932", "馬爾洛克‧石碎", "等級597 雙手 法杖", "", "skull_grey", "rare_ng","116796"},
	[45801520]={ "36229", "老皮恩奇先生", "等級616 雙擊 飾品 + (攻擊召喚蝦怪守護者)", "", "skull_grey", "rare_ng","118690"},
	[34105150]={ "37224", "穆格拉", "把它交給賈茲莫夫‧牛仔(洛克拉斯的西邊 座標:50, 41)來獲取500點熱砂保護協會聲望", "", "swprare", "rare_s_ng","118659"},
	[47607040]={ "35865", "虛無生靈", "寵物", "", "skull_green", "rare_ng","116815"},
	[42804920]={ "35875", "歐菲斯", "等級602 布甲 腿部", "", "skull_grey", "rare_ng","116765"},
	[61806900]={ "35943", "先遣騎杜瑞莎", "等級598 皮甲 腳", "在山崖上", "skull_grey", "rare_ng","116800"},
	[58201860]={ "37637", "試煉場巨獸", "等級620 坦克 披風 (機率掉落)", "", "skull_blue", "rare_h_ng","120317"},
	[39501390]={ "37397", "深淵殺手", "等級620 力量 戒指 (機率掉落)", "點擊深淵殺手的戰利品召喚 (你必須有破碎絕壁的每日或要塞戰役任務才能點擊)", "skull_blue", "rare_h_ng","119389"},
	[73605780]={ "35712", "『兇蠻的』赤爪", "等級604 智力 拳套", "", "skull_grey", "rare_ng","118243"},
	[58008400]={ "35900", "盧克拉", "等級608 鎧甲 肩部", "", "skull_grey", "rare_ng","118688"},
	[54706140]={ "35931", "斥候波克哈爾", "等級601 力量 單手 斧", "在山崖上", "skull_grey", "rare_ng","116797"},
	[60934775]={ "35912", "尚恩‧懷特西", "等級600 皮甲 腰部", "點擊被遺棄的箱子召喚", "skull_grey", "rare_ng","116834"},
	[75506540]={ "36128", "魂牙", "等級597 智力 單手 劍", "在山洞內", "skull_grey", "rare_ng","116806"},
	[58403580]={ "37225", "巨爪", "把它交給賈茲莫夫‧牛仔(洛克拉斯的西邊 座標:50, 41)來獲取500點熱砂保護協會聲望", "在附近一大片區域內飛行", "swprare", "rare_s_ng","118660"},
	[64903910]={ "35920", "圖拉亞卡", "等級609 敏捷 披風", "", "skull_grey", "rare_ng","116814"},
	[37003800]={ "37520", "邪爪", "把它交給賈茲莫夫‧牛仔(洛克拉斯的西邊 座標:50, 41)來獲取500點熱砂保護協會聲望", "", "swprare", "rare_s_ng","120172"},
	[82707640]={ "34645", "將領布魯格索", "等級600 鎧甲 手腕", "", "skull_grey", "rare_ng","116805"},
	[70602940]={ "35877", "喚風者寇拉斯特", "等級598 智力 法杖", "在山崖上; 需要從元素高原才能到達", "skull_grey", "rare_ng","116808"},
	[41004400]={ "37226", "澤加納克", "把它交給賈茲莫夫‧牛仔(洛克拉斯的西邊 座標:50, 41)來獲取500點熱砂保護協會聲望", "", "swprare", "rare_s_ng","118661"},
	[26203420]={ "40075", "魯多格", "寵物 (機率掉落)", "需要飛行座騎或飛行道具才能到達", "skull_green", "rare_h_ng","129216"},
	[23803790]={ "40074", "古克", "寵物 (機率掉落)", "需要飛行座騎或飛行道具才能到達", "skull_green", "rare_h_ng","129218"},
	[28503030]={ "40073", "巴格", "寵物 (機率掉落)", "需要飛行座騎或飛行道具才能到達", "skull_green", "rare_h_ng","129217"},
    [49803420]={ "99999910", "『雷鳴者』納克", "", "", "skull_yellow", "mount_na", "116659"},
    [55203560]={ "99999910", "『雷鳴者』納克", "", "", "skull_yellow", "mount_na", "116659"},
    [62801540]={ "99999910", "『雷鳴者』納克", "", "", "skull_yellow", "mount_na", "116659"},
    [64601980]={ "99999910", "『雷鳴者』納克", "", "", "skull_yellow", "mount_na", "116659"},
    [66604360]={ "99999911", "盧可哈克", "", "", "skull_orange", "mount_lu", "116661"},
    [72805550]={ "99999911", "盧可哈克", "", "", "skull_orange", "mount_lu", "116661"},
    [76003600]={ "99999911", "盧可哈克", "", "", "skull_orange", "mount_lu", "116661"},
    [79605560]={ "99999911", "盧可哈克", "", "", "skull_orange", "mount_lu", "116661"},
    [84806380]={ "99999911", "盧可哈克", "", "", "skull_orange", "mount_lu", "116661"},
    [40504760]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [44003080]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [57402640]={ "99999906", "真實之緣", "隨機刷新", "", "skull_purple", "mount_vt", "121815"},
    [51001600]={ "37210", "奧吉克森", "把它交給賈茲莫夫‧牛仔(洛克拉斯的西邊 座標:50, 41)來獲取500點熱砂保護協會聲望", "", "swprare", "rare_s_ng","118654"},
    [80105040]={ "39265", "維京人皮皮", "皮皮裝飾品", "", "default", "treasure_ng", "127865"},
}

nodes["TanaanJungle"] = {
	[15005440]={ "38754", "哀泣蒼狼之斧", "等級650 力量 雙手 斧", "在塔底", "default", "treasure_tj","127325"},
	[15905930]={ "38757", "葛拉諾克之眼", "等級650 智力 + 加速 + 雙擊 飾品", "在塔的第二層", "default", "treasure_tj","128220"},
	[17305690]={ "38755", "戰利品", "", "", "default", "treasure_tj","824"},
	[17005300]={ "38283", "被偷的船長箱子", "金錢和食物", "", "default", "treasure_tj","128219"},
	[15904980]={ "38208", "陳舊的斧頭", "等級650 敏捷 單手 斧", "在山洞內", "default", "treasure_tj","127324"},
	[25305020]={ "38735", "『借來的』魔法望遠鏡", "等級650 智力 + 致命一擊 飾品", "在塔頂; 在塔底使用繩鉤和繩索到達塔頂", "default", "treasure_tj","128222"},
	[22004780]={ "38678", "血之谷戰箱", "", "", "default", "treasure_tj","824"},
	[26804410]={ "38683", "搶來的血之谷寶藏", "玩具", "需要塔南森林戰役「血之谷死敵」", "default", "treasure_tj","127709"},
	[19304090]={ "38320", "可拉納克之刃", "等級650 敏捷 單手 劍", "在水底", "default", "treasure_tj","127338"},
	[31403110]={ "38732", "鑲滿珠寶的阿拉卡肖像", "珠寶學製品", "要由石頭上跳上去", "default", "treasure_tj","127413"},
	[28803460]={ "38863", "部份開採的頂尖水晶", "頂尖水晶", "在平光洞穴(入口座標：29.2, 31.1)", "default", "treasure_tj","823"},
	[34703460]={ "38742", "瘋狂酋長的顱骨", "暫時性提高200%移動速度 (15分鐘冷卻; 只能在德拉諾使用)", "在山洞內(入口座標：32.5, 37.4)", "default", "treasure_tj","127669"},
	[26506300]={ "38741", "搶來的血之谷寶藏", "頂尖水晶 + 要塞資源", "在塔頂; 在塔底使用繩鉤和繩索到達塔頂", "default", "treasure_tj","823"},
	[32407040]={ "38426", "奧秘魔典", "玩具", "", "default", "treasure_tj","127670"},
	[30407200]={ "38629", "拋光水晶", "珠寶學製品", "", "default", "treasure_tj","127390"},
	[37004620]={ "38640", "蒼白獸人抹殺裝置", "", "", "default", "treasure_tj","824"},
	[36304350]={ "37956", "奇怪的藍寶石", "等級650 耐力 + 額外護甲值 飾品", "", "default", "treasure_tj","127397"},
	[43203830]={ "38821", "指揮官之盾", "等級650 盾牌", "", "default", "treasure_tj","127348"},
	[42803540]={ "38822", "燦爛節杖", "玩具", "在東北塔的塔頂", "default", "treasure_tj","127859"},
	[46904210]={ "38776", "獻祭之刃", "等級650 智力 匕首", "", "default", "treasure_tj","127328"},
	[46904440]={ "38773", "魔浸背袋", "塑型物品(護目鏡)", "", "default", "treasure_tj","128218"},
	[46903660]={ "38771", "吉及克斯之書", "等級650 智力 副手物品", "", "default", "treasure_tj","127347"},
	[50806490]={ "38731", "過度成長的聖物", "等級650 敏捷/力量 戒指", "", "default", "treasure_tj","127412"},
	[54806930]={ "38593", "置放的狩獵長矛", "等級650 敏捷 長柄武器", "", "default", "treasure_tj","127334"},
	[47907040]={ "38705", "晶化元素精華", "等級650 智力 拳套", "", "default", "treasure_tj","127329"},
	[57006500]={ "38591", "被遺忘的袋子", "趣味物品 - 冒險日誌 + 垃圾物品 + 生獸皮", "", "default", "treasure_tj","110609"},
	[46207280]={ "38739", "神秘的腐化之柱", "趣味物品 - 放在地上後會攻擊附近敵人", "在洞穴內; 需要塔南森林戰役「毀滅密碼」", "default", "treasure_tj","128320"},
	[41607330]={ "38657", "被遺忘的勇士之刃", "等級650 力量 雙手 劍", "", "default", "treasure_tj","127339"},
	[40807550]={ "38639", "完美的花朵", "玩具", "需要先拾取神秘的果實才能拾取這寶藏", "default", "treasure_tj","127766"},
	[40607980]={ "38638", "巨魔舞蛇人之笛", "等級650 智力 雙手 錘", "", "default", "treasure_tj","127333"},
	[34407830]={ "38762", "藏起來的鋼鐵之海寶藏", "金錢 + 要塞資源", "在背叛洞穴(入口座標：37.5, 75.0)", "default", "treasure_tj","824"},
	[35007730]={ "38761", "藏起來的鋼鐵之海寶藏", "金錢 + 要塞資源", "在背叛洞穴(入口座標：37.5, 75.0)", "default", "treasure_tj","824"},
	[33907810]={ "38760", "藏起來的鋼鐵之海寶藏", "金錢 + 要塞資源", "在背叛洞穴(入口座標：37.5, 75.0)", "default", "treasure_tj","824"},
	[35907860]={ "38758", "鐵鬚的寶藏", "金錢 + 要塞資源", "在背叛洞穴(入口座標：37.5, 75.0); 需要從另一邊潛水過去", "default", "treasure_tj","824"},
	[37708070]={ "38788", "覺醒火盆", "復活道具(30分鐘冷卻)", "", "default", "treasure_tj","127770"},
	[48507520]={ "38814", "搶來的奧秘之杖", "等級650 智力 法杖", "在司諦迦納洞穴(入口座標：44.4, 77.5)", "default", "treasure_tj","127337"},
	[49907680]={ "38809", "血之谷蘑菇桶", "飲料(喝了後會有周圍的人變魔花人的BUFF)", "在司諦迦納洞穴(入口座標：44.4, 77.5)", "default", "treasure_tj","128223"},
	[62107070]={ "38602", "晶化的魔化尖刺", "等級650 智力 + 精神 飾品", "", "default", "treasure_tj","128217"},
	[61207580]={ "38601", "黑牙島嶼補給品", "", "", "default", "treasure_tj","824"},
	[49907960]={ "38703", "斥侯的物品", "等級650 敏捷 背部", "洞穴的頂部", "default", "treasure_tj","127354"},
	[49908120]={ "38702", "被丟棄的頭盔", "等級650 鎖甲 頭部", "在山洞內", "default", "treasure_tj","127312"},
	[64704280]={ "38701", "奇怪的水果", "玩具 (需14天時間孵化)", "在樹上; 點擊鬆軟的土壤到達樹上", "default", "treasure_tj","127396"},
	[51702430]={ "38686", "符文蝕刻腿骨", "等級650 魔杖", "", "default", "treasure_tj","127341"},
	[58502520]={ "38679", "殞星珠寶", "珠寶學製品", "", "default", "treasure_tj","115524"},
	[62602050]={ "38682", "苦難香爐", "等級650 力量 + 臨機應變 飾品", "", "default", "treasure_tj","127401"},
	[51603270]={ "39075", "魔化污染的頂尖水晶體", "", "懸掛在柱子邊", "default", "treasure_tj","823"},
	[28702330]={ "38334", "地獄火珠寶", "玩具", "", "default", "treasure_tj","127668"},
	[63402810]={ "38740", "被遺忘的密碼裂片", "寵物", "需要塔南森林戰役「毀滅密碼」", "default", "treasure_tj","128309"},
	[54909070]={ "39470", "死人的箱子", "", "", "default", "treasure_tj","824"},
	[65908500]={ "39469", "珠寶蛋", "垃圾物品", "", "default", "treasure_tj","128386"},
	[69705600]={ "38704", "被遺忘的鋼鐵部落補給品", "", "", "default", "treasure_tj","824"},
	[73604320]={ "38779", "藏起來的血之谷寶藏", "金錢 + 垃圾物品", "在獸人前面", "default", "treasure_tj","27729"},
	[13605680]={ "38747", "索加‧血拳", "等級655 鎖甲 腳 (機率掉落)", "", "skull_blue", "rare_h_tj","127310","28347"},
	[13005700]={ "38751", "鋼鐵馴犬者", "等級655 鎧甲 肩部 (機率掉落)", "在佔領據點後出現(需要協助鋼鐵前線的戰鬥)", "skull_blue", "rare_h_tj","127321","28350"},
	[16005920]={ "38750", "葛拉諾克", "等級655 智力 頸部 (機率掉落)", "在塔頂", "skull_blue", "rare_h_tj","127649","28348"},
	[15005420]={ "38746", "指揮官克拉戈斯", "等級655 鎧甲 手 (機率掉落)", "在塔頂", "skull_blue", "rare_h_tj","127319", "28346"},
	[16005720]={ "38752", "『扭曲者』斯澤瑞克", "等級655 布甲 手 (機率掉落)", "在佔領據點後出現(需要協助鋼鐵前線的戰鬥)", "skull_blue", "rare_h_tj","127296","28349"},
	[16804860]={ "38282", "魔花王瓦卡旺", "等級655 敏捷 法杖 (機率掉落)", "在雨蕨洞穴(入口座標：17, 50)", "skull_blue", "rare_h_tj","127336", "28329"},
	[23605200]={ "38262", "『擲矛手』畢爾寇", "等級655 布甲 肩部 (機率掉落)", "", "skull_blue", "rare_h_tj","127307","28351"},
	[20404980]={ "38263", "『追蹤者』羅剛", "等級655 鎖甲 肩部 (機率掉落)", "", "skull_blue", "rare_h_tj","127314","28352"},
	[19805360]={ "38736", "邪惡的德里斯", "等級655 槍械 (機率掉落)", "在塔頂; 在塔底使用繩鉤和繩索到達塔頂", "skull_blue", "rare_h_tj","127331","28369"},
	[25504620]={ "38264", "卓夫努爾", "等級655 布甲 腿部 (機率掉落)", "", "skull_blue", "rare_h_tj","127298","28354"},
	[23204840]={ "38265", "『蠻血者』多格", "等級655 布甲 腰部 (機率掉落)", "", "skull_blue", "rare_h_tj","127301","28353"},
	[22805120]={ "38266", "血獵人佐克", "等級655 皮甲 腳 (機率掉落)", "", "skull_blue", "rare_h_tj","127303","28355"},
	[22205080]={ "39159", "血月殘渣", "玩具 (機率掉落)", "事件刷新後會在地圖上標示並顯示喊話「血之谷傳令官大喊：血月升起，酋長的力量更加強勁！歡呼吧！血之谷的族人，酋長很快就會無人能敵！」; 使用枯竭的血水晶(附近拾取)吸收血月之力至0%就會出現", "skull_green", "rare_h_tj","127666"},
	[16804340]={ "38034", "拉司", "等級655 致命一擊 + 精通 + 雙擊 飾品 (機率掉落)", "", "skull_blue", "rare_h_tj","127661","28341"},
	[20404000]={ "38028", "高階祭司伊卡贊", "玩具", "擊殺附近鴉人會使他刷新", "skull_green", "rare_h_tj","122117","28356"},
	[27603280]={ "37937", "『遭譴者』瓦瑞克斯", "等級655 智力 戒指 (機率掉落)", "", "skull_blue", "rare_h_tj","127351", "28340"},
	[26305420]={ "38496", "雷戈", "等級655 敏捷 長柄武器 (機率掉落)", "", "skull_blue", "rare_h_tj","127335","28356"},
	[28605080]={ "38775", "魔穿", "等級655 力量 戒指 (機率掉落)", "在魔穿洞窟(入口座標：31.3, 53.5)", "skull_blue", "rare_h_tj","127350","28372"},
	[31406800]={ "38031", "賽拉薩斯", "寵物", "擊殺後可在附近獲得戰寵[魔化幼狼]", "skull_green", "rare_h_tj","","28336"},
	[27607480]={ "38030", "傑克索", "等級655 鎧甲 腰部 (機率掉落)", "在山洞內(入口座標：29.6, 70.6)", "skull_blue", "rare_h_tj","127322","28335"},
	[25807900]={ "38032", "魔女薩芙菈", "等級655 布甲 肩部 (機率掉落)", "在夏納瑞洞窟第二層(入口座標：29.6, 70.6)", "skull_blue", "rare_h_tj","127300","28337"},
	[25407720]={ "38029", "歐蘭女士", "等級655 鎖甲 手腕 (機率掉落)", "在夏納瑞洞窟(入口座標：29.6, 70.6)", "skull_blue", "rare_h_tj","127316","28334"},
	[31607280]={ "38026", "小鬼召喚師瓦勒莎", "趣味物品 - 召喚魔化小鬼 (機率掉落)", "", "skull_green", "rare_h_tj","127655","28333"},
	[35404680]={ "38609", "貝爾戈克", "等級655 盾牌 (機率掉落)", "在鐵戰堡(入口座標：38, 44/ 42, 49)", "skull_blue", "rare_h_tj","127650","28363"},
	[34004440]={ "38620", "『切腸者』索羅瑪", "等級655 敏捷 匕首 (機率掉落)", "在鐵戰堡(入口座標：38, 44/ 42, 49)", "skull_blue", "rare_h_tj","127327","28362"},
	[33003570]={ "38709", "葛拉伯許", "等級655 皮甲 手 (機率掉落)", "", "skull_blue", "rare_h_tj","127304","28368"},
	[37003280]={ "39045", "『泰山壓頂』佐戈", "等級655 皮甲 腰部 (機率掉落)", "", "skull_blue", "rare_h_tj","127308","28723"},
	[39603260]={ "39046", "港口統領寇拉克", "等級655 鎖甲 胸部 (機率掉落)", "", "skull_blue", "rare_h_tj","127309","28724"},
	[42403730]={ "37953", "莫葛拉克中士", "等級655 鎧甲 腳 (機率掉落)", "", "skull_blue", "rare_h_tj","127318","28339"},
	[44603760]={ "37990", "『野火』辛德羅", "等級655 臨機應變 + 精通 + 雙擊 飾品 (機率掉落)", "擊殺所有辛德羅的殘軀會使他刷新", "skull_blue", "rare_h_tj","127660","28338"},
	[45804700]={ "38634", "魔匠達茉卡", "等級655 皮甲 胸部 (機率掉落)", "", "skull_blue", "rare_h_tj","127302","28726"},
	[50003600]={ "38411", "處決者瑞洛斯", "等級655 鎧甲 手腕 (機率掉落)", "", "skull_blue", "rare_h_tj","127323","28380"},
	[46204240]={ "38400", "大術士奈德克斯", "等級655 布甲 胸部 (機率掉落)", "", "skull_blue", "rare_h_tj","127299","28343"},
	[51004600]={ "38749", "指揮官歐格莫克", "等級655 鎖甲 腿部 (機率掉落)", "騎著熔岩犬周圍巡邏", "skull_blue", "rare_h_tj","127313","28731"},
	[48005720]={ "38820", "葛羅克瑪隊長", "等級655 鎧甲 腿部 (機率掉落)", "", "skull_blue", "rare_h_tj","127664","28730"},
	[49706140]={ "38812", "影碎", "等級655 皮甲 手腕 (機率掉落)", "", "skull_blue", "rare_h_tj","127665","28725"},
	[52206510]={ "38726", "瑪格威亞", "等級655 力量 單手錘 (機率掉落)", "", "skull_blue", "rare_h_tj","127332","28345"},
	[40807000]={ "38209", "落棘", "玩具 (機率掉落)", "", "skull_green", "rare_h_tj","127652" ,"28330"},
	[39606810]={ "38825", "罪不可赦的克里斯加", "等級655 力量 單手劍 (機率掉落)", "在隱密的沼澤遺跡(入口座標：42.5, 68.9)", "skull_blue", "rare_h_tj","127653","28377"},
	[34307250]={ "38654", "血爪", "等級655 皮甲 頭部 (機率掉落)", "在迅猛龍之喉(入口座標：36.2, 72.4)", "skull_blue", "rare_h_tj","127305","28367"},
	[39407380]={ "38632", "夜魂", "等級655 力量 背部 (機率掉落)", "出現在佐朗沼澤的隨機地點(潛行狀態),接觸後轉換位置; 接觸10次後才能攻擊", "skull_blue", "rare_h_tj","127355","28366"},
	[41007880]={ "38628", "魅蛇", "等級655 鎖甲 手 (機率掉落)", "", "skull_blue", "rare_h_tj","127311","28364"},
	[41807380]={ "38631", "倫達克", "等級655 智力 背部 (機率掉落)", "需要從佐朗沼澤天上的魔翼掠食者收集10個[濃郁的麝香腺體]召喚", "skull_blue", "rare_h_tj","127356","28365"},
	[36207970]={ "38756", "鐵鬚船長", "玩具 (機率掉落)", "在背叛洞穴(入口座標：37.5, 75.0)", "skull_green", "rare_h_tj","127659","28370"},
	[34607820]={ "38764", "咕嚕嗝嚕", "等級655 鎧甲 胸部 (機率掉落)", "在背叛洞穴(入口座標：37.5, 75.0); 點擊鐵鬚的寶藏使他刷新", "skull_blue", "rare_h_tj","127317","28371"},
	[51007440]={ "38696", "血之谷恐獸", "等級655 耐力 + 額外護甲值 飾品 (機率掉落)", "在司諦迦納洞穴(入口座標：44.4, 77.5)", "skull_blue", "rare_h_tj","127654","28376"},
	[57606720]={ "38589", "王蟲伊斯寇", "等級655 敏捷 戒指 (機率掉落)", "", "skull_blue", "rare_h_tj","127349","28357"},
	[62607200]={ "38600", "割魂者", "等級655 鎖甲 腰部 (機率掉落)", "", "skull_blue", "rare_h_tj","127315","28358"},
	[63608110]={ "38604", "黯爪", "等級655 皮甲 腿部 (機率掉落)", "", "skull_blue", "rare_h_tj","127306","28359"},
	[52108390]={ "38605", "『靜思者』克雷爾", "等級655 敏捷 + 雙擊 飾品 (機率掉落)", "", "skull_blue", "rare_h_tj","127418","28360"},
	[48807280]={ "38597", "黑牙", "等級655 敏捷 拳套 (機率掉落)", "", "skull_blue", "rare_h_tj","127330","28361"},
	[48402850]={ "38207", "澤特爾", "等級655 力量 雙手劍 (機率掉落)", "在荒疫洞窟(入口座標：48.1, 33.0)", "skull_blue", "rare_h_tj","127340","28331"},
	[52802560]={ "38211", "魔焰", "等級655 布甲 手腕 (機率掉落)", "", "skull_blue", "rare_h_tj","127656","28332"},
	[53602170]={ "38557", "痛苦魔女賽洛拉", "等級655 布甲 頭部 (機率掉落)", "要殺死所有從傳送門出現的惡魔才會出現", "skull_blue", "rare_h_tj","127297","28342"},
	[57102280]={ "38457", "普崔薩爾", "等級655 智力 + 精神 飾品 (機率掉落)", "", "skull_blue", "rare_h_tj","127657","28727"},
	[53002000]={ "38580", "霸主馬古魯斯", "等級655 鎧甲 頭部 (機率掉落)", "擊殺附近魔化獸人會使他刷新", "skull_blue", "rare_h_tj","127320","28729"},
	[60202090]={ "38579", "『恆存者』贊茲斯", "等級655 智力 副手物品 (機率掉落)", "", "skull_blue", "rare_h_tj","127658","28728"},
	[65403660]={ "38700", "鐵鼻", "等級655 敏捷/力量 背部 (機率掉落)", "", "skull_blue", "rare_h_tj","127357","28344"},
	[52504020]={ "38430", "『毀滅者』亞戈許", "等級655 弩 (機率掉落)", "要殺死所有魔血術士才能攻擊", "skull_blue", "rare_h_tj","127326","28722"},
	[39908220]={ "37407", "克拉沃斯", "原始之魂 + 頂尖水晶", "", "skull_blue", "rare_h_tj","120945"},
	[88005550]={ "40104", "史麥辛‧葛拉布", "玩具 (機率掉落)", "需要飛行座騎或飛行道具才能到達", "skull_green", "rare_h_tj","108634"},
	[83504380]={ "40105", "杜拉昆", "玩具 (機率掉落)", "需要飛行座騎或飛行道具才能到達", "skull_green", "rare_h_tj","108631"},
	[80405680]={ "40106", "岡達爾", "玩具 (機率掉落)", "需要飛行座騎或飛行道具才能到達", "skull_green", "rare_h_tj","108633"},
	[40705630]={ "40107", "惡魔監督者馬朗", "擊落座騎道具 (機率掉落)", "需要飛行座騎或飛行道具才能到達", "skull_green", "rare_h_tj","129295"},
	[15406340]={ "39288", "恐懼之拳", "座騎 (機率掉落) + 提升聲望道具 (機率掉落) + 油料", "刷新後會在地圖上標示並顯示喊話「佛洛甘大喊：有隻巨大的小古羅正朝遊俠營地直衝而去！我們需要幫手！」", "skull_red", "mount_tj","128025"},
	[23204040]={ "39287", "死亡之爪", "座騎 (機率掉落) + 提升聲望道具 (機率掉落) + 油料", "刷新後會在地圖上標示並顯示喊話「暗影領主伊斯卡大喊：迷霧之中，只有死亡！」", "skull_red", "mount_tj","128025"},
	[32407400]={ "39290", "復仇之靈", "座騎 (機率掉落) + 提升聲望道具 (機率掉落) + 油料", "刷新後會在地圖上標示並顯示喊話「女暴君維哈里大喊：臭蟲，就應該要踩扁！」", "skull_red", "mount_tj","128025"},
	[47005260]={ "39289", "毀滅之輪", "座騎 (機率掉落) + 提升聲望道具 (機率掉落) + 油料", "刷新後會在地圖上標示並顯示喊話「攻城大師瑪塔珂大喊：哈！踩爛他們的屍體！」", "skull_red", "mount_tj","128025"},
	[55307500]={ "39416", "史寇勒", "玩具", "跟NPC對話獲得", "default", "treasure_tj","128328"},
}

nodes["garrisonsmvalliance_tier1"] = {
	[49604380]={ "35530", "落月之蛋", "", "在馬車上", "default", "treasure_smv","824"},
	[42405436]={ "35381", "皮皮埋藏的補給品", "", "", "default", "treasure_smv","824"},
	[50704850]={ "35382", "皮皮埋藏的補給品", "", "", "default", "treasure_smv","824"},
	[30802830]={ "35383", "皮皮埋藏的補給品", "", "", "default", "treasure_smv","824"},
	[49197683]={ "35384", "皮皮埋藏的補給品", "", "", "default", "treasure_smv","824"},
	[51800110]={ "35289", "史卡皮偷走的補給品", "", "湖底的洞穴內", "default", "treasure_smv","824"},
}

nodes["garrisonsmvalliance_tier2"] = {
	[37306590]={ "35530", "落月之蛋", "", "在馬車上", "default", "treasure_smv","824"},
	[41685803]={ "35381", "皮皮埋藏的補給品", "", "", "default", "treasure_smv","824"},
	[51874545]={ "35382", "皮皮埋藏的補給品", "", "", "default", "treasure_smv","824"},
	[34972345]={ "35383", "皮皮埋藏的補給品", "", "", "default", "treasure_smv","824"},
	[46637608]={ "35384", "皮皮埋藏的補給品", "", "", "default", "treasure_smv","824"},
	[51800110]={ "35289", "史卡皮偷走的補給品", "", "湖底的洞穴內", "default", "treasure_smv","824"},
}

nodes["garrisonsmvalliance_tier3"] = {
	[61277261]={ "35530", "落月之蛋", "", "在帳篷裡", "default", "treasure_smv","824"},
	[60575515]={ "35381", "皮皮埋藏的補給品", "", "", "default", "treasure_smv","824"},
	[37307491]={ "35382", "皮皮埋藏的補給品", "", "", "default", "treasure_smv","824"},
	[37864378]={ "35383", "皮皮埋藏的補給品", "", "", "default", "treasure_smv","824"},
	[61527154]={ "35384", "皮皮埋藏的補給品", "", "", "default", "treasure_smv","824"},
	[51800110]={ "35289", "史卡皮偷走的補給品", "", "湖底的洞穴內", "default", "treasure_smv","824"},
}

nodes["garrisonffhorde_tier1"] = {
	[74505620]={ "34937", "席娜女士的其他物資", "", "", "default", "treasure_ffr","824"},
}

nodes["garrisonffhorde_tier2"] = {
	[74505620]={ "34937", "席娜女士的其他物資", "", "", "default", "treasure_ffr","824"},
}

nodes["garrisonffhorde_tier3"] = {
	[74505620]={ "34937", "席娜女士的其他物資", "", "", "default", "treasure_ffr","824"},
}

nodes["MardumtheShatteredAbyss"] = {
	[34857020]={ "39970", "小型藏寶箱", "戰鬥增益物品", "在山洞內", "default", "treasure_dh", "129210"},
	[45017785]={ "39971", "小型藏寶箱", "精煉藥劑", "", "default", "treasure_dh", "129192"},
	[41763761]={ "40759", "小型藏寶箱", "治療藥水", "", "default", "treasure_dh", "129196"},
	[51135079]={ "40743", "小型藏寶箱", "戰鬥增益物品", "", "default", "treasure_dh", "129210"},
	[76243899]={ "40338", "小型藏寶箱", "戰鬥增益物品", "在山洞內; 入口座標：77.0,41.4", "default", "treasure_dh", "129210"},
	[82075043]={ "40820", "小型藏寶箱", "治療藥水", "", "default", "treasure_dh", "129196"},
	[78755047]={ "40274", "小型藏寶箱", "戰鬥增益物品", "在山洞內", "default", "treasure_dh", "129210"},
	[73494892]={ "39975", "小型藏寶箱", "28格背包", "", "default", "treasure_dh", "129195"},
	[42194916]={ "40223", "小型藏寶箱", "戰鬥增益物品", "在山洞內", "default", "treasure_dh", "129210"},
	[23065389]={ "40797", "小型藏寶箱", "戰鬥增益物品", "在山洞內; 入口座標：23.6,54.2", "default", "treasure_dh", "129210"},
	[66922767]={ "39974", "小型藏寶箱", "戰鬥增益物品", "在山洞內", "default", "treasure_dh", "129210"},
	[74285453]={ "39977", "小型藏寶箱", "戰鬥增益物品", "在山洞內; 入口座標：70.7,54.0", "default", "treasure_dh", "129210"},
	[69704240]={ "39976", "小型藏寶箱", "戰鬥增益物品", "", "default", "treasure_dh", "129210"},
	
	[68852759]={ "40234", "沃羅斯將軍", "等級680 手腕", "", "skull_grey", "rare_dh", "128947"},
	[81034124]={ "40233", "監督者布魯塔格", "等級680 飾品", "", "skull_grey", "rare_dh", "133580"},
	[74475731]={ "40232", "魔蛛王渥拉斯", "等級680 背部", "", "skull_grey", "rare_dh", "128944"},
}

nodes["CrypticHollow"] = {
	[48761530]={ "39972", "小型藏寶箱", "治療藥水", "", "default", "treasure_dh", "129196"},
	[54855845]={ "39973", "小型藏寶箱", "等級680 手指", "", "default", "treasure_dh", "128946"},
}

nodes["SoulEngine"] = {
	[50304964]={ "40772", "小型藏寶箱", "戰鬥增益物品", "在上層", "default", "treasure_dh", "129210"},
	[51235740]={ "40231", "惡毒伯爵", "等級680 手指", "在下層", "skull_grey", "rare_dh", "128948"},
}

nodes["VaultOfTheWardensDH"] = {
	[58693475]={ "40909", "小型藏寶箱", "戰鬥增益物品", "第一層", "default", "treasure_dh", "129210"},
	[47325464]={ "38690", "小型藏寶箱", "戰鬥增益物品", "第一層", "default", "treasure_dh", "129210"},
	[32104817]={ "40911", "小型藏寶箱", "治療藥水", "第二層", "default", "treasure_dh", "129196"},
	[41506361]={ "40914", "小型藏寶箱", "治療藥水", "第二層", "default", "treasure_dh", "129196"},
	[56994013]={ "40913", "小型藏寶箱", "戰鬥增益物品", "第二層", "default", "treasure_dh", "129210"},
	[41413287]={ "40912", "小型藏寶箱", "戰鬥增益物品", "第二層", "default", "treasure_dh", "129210"},
	[24421005]={ "40915", "小型藏寶箱", "戰鬥增益物品", "第三層", "default", "treasure_dh", "129210"},
	[23268157]={ "40916", "小型藏寶箱", "戰鬥增益物品", "第三層", "default", "treasure_dh", "129210"},
	
	[69202820]={ "40301", "憤怒領主雷寇斯", "等級680 飾品", "第一層", "skull_grey", "rare_dh", "128958"},
	[49543284]={ "40251", "克斯拉佐", "等級680 頸部", "第一層", "skull_grey", "rare_dh", "128945"},
}

if (PlayerFaction == "Alliance") then
	--nodes["ShadowmoonValleyDR"][29600620]={ "35281", "Bahameye", "Fire Ammonite", "", "rare", "SMVRares","111666"}(Horde also can get it)
	nodes["Gorgrond"][60805400]={ "36502", "拜歐蘭特", "提供經驗的任務物品", "你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","116159"}
	nodes["Gorgrond"][46004680]={ "35816", "夏爾‧末日之翼", "提供經驗的任務物品", "在附近一大片區域內飛行; 你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","113457"}
	nodes["Gorgrond"][42805920]={ "35812", "隕坑領主伊格涅斯", "提供經驗的任務物品", "你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","113449"}
	nodes["Gorgrond"][38905110]={ "35809", "亡者之池的德希克斯", "提供經驗的任務物品", "你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","113446"}
	nodes["Gorgrond"][51804150]={ "35808", "『暴力』艾洛西恩", "提供經驗的任務物品", "你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","113445"}
	nodes["Gorgrond"][58006360]={ "35813", "真菌巨衛", "提供經驗的任務物品", "你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","113453"}
	--nodes["ShadowmoonValleyDR"][21603300]={ "33664", "Gorum", "i516 Agility/Intellect Ring", "Inside Bloodthorn Cave - Spawns at the Ceiling", "rare", "SMVRares","113082"}(Horde also can get it)
	nodes["Gorgrond"][52406580]={ "35820", "『吞噬者』卡爾賈斯", "提供經驗的任務物品", "你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","113461"}
	nodes["ShadowmoonValleyDR"][30301990]={ "35530", "落月之蛋", "", "當你建造要塞時會改變位置", "default", "treasure_smv","824"}
	nodes["Gorgrond"][51206360]={ "35817", "『天空之懼』洛爾丹", "提供經驗的任務物品", "在附近一大片區域內飛行; 你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","113458"}
	nodes["ShadowmoonValleyDR"][42804100]={ "33038", "風牙族母", "等級516 單手劍", "跟羅穆爾交談並擊退兩次狼群的攻擊後出現", "skull_grey", "rare_smv","113553"}
	nodes["Talador"][57207540]={ "34134", "伊莎莉的儲藏箱", "等級564 敏捷 頸部", "", "default", "treasure_td","117563"}
	nodes["Talador"][77605710]={ "34199", "『緋紅之爪』凱努", "", "進行拯救隱士的居所期間擊退兩次阿拉卡的攻擊後出現", "skull_grey", "rare_td","824"}
	nodes["Talador"][40608950]={ "34140", "尤里的禮物", "", "需要先完成聖光之墓尤里的任務", "default", "treasure_td","824"}
	nodes["SpiresOfArak"][40106030]={ "35627", "阿拉卡貨物籃", "要塞資源 + 藥劑 + 食物", "需先建造哨站", "default", "treasure_soa","824"}
end

if (PlayerFaction == "Horde") then
	nodes["Gorgrond"][60805400]={ "36503", "拜歐蘭特", "提供經驗的任務物品", "你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","116160"}
	nodes["Gorgrond"][46004680]={ "35815", "夏爾‧末日之翼", "提供經驗的任務物品", "在附近一大片區域內飛行; 你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","113456"}
	nodes["Gorgrond"][42805920]={ "35811", "隕坑領主伊格涅斯", "提供經驗的任務物品", "你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","113448"}
	nodes["Gorgrond"][38905110]={ "35810", "亡者之池的德希克斯", "提供經驗的任務物品", "你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","113447"}
	nodes["Gorgrond"][51804150]={ "35807", "『暴力』艾洛西恩", "提供經驗的任務物品", "你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","113444"}
	nodes["Gorgrond"][58006360]={ "35814", "真菌巨衛", "提供經驗的任務物品", "你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","113454"}
	nodes["Gorgrond"][52406580]={ "35819", "『吞噬者』卡爾賈斯", "提供經驗的任務物品", "你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","113460"}
	nodes["Talador"][61107170]={ "34116", "諾菈娜的儲物箱", "等級564 敏捷 頸部", "", "default", "treasure_td","117563"}
	nodes["Gorgrond"][53006310]={ "35818", "『天空之懼』洛爾丹", "提供經驗的任務物品", "在附近一大片區域內飛行; 你需要完成此任務才能把標記從地圖移除", "skull_grey", "rare_gg","113459"}
	nodes["FrostfireRidge"][45365034]={ "33011", "布滿灰塵的箱子", "等級516 耐力 飾品 (擊殺觸發治療)", "和蒼老的霜狼精兵對話並幫助他擊退敵人才可拾取", "default", "treasure_ffr","106899"}
	nodes["SpiresOfArak"][40104390]={ "35627", "阿拉卡貨物籃", "要塞資源 + 藥劑 + 食物", "需先建造哨站", "default", "treasure_soa","824"}
end

local function GetItem(ID)
    if (ID == "824" or ID == "823" or ID == "829") then
        local currency, _, _ = GetCurrencyInfo(ID)

        if (currency ~= nil) then
            return currency
        else
            return "貨幣ID載入錯誤"
        end
    else
        local _, item, _, _, _, _, _, _, _, _ = GetItemInfo(ID)

        if (item ~= nil) then
            return item
        else
            return "物品ID載入錯誤"
        end
    end
end 

local function GetIcon(ID)
    if (ID == "824" or ID == "823" or ID == "829") then
        local _, _, icon = GetCurrencyInfo(ID)

        if (icon ~= nil) then
            return icon
        else
            return "Interface\\Icons\\inv_misc_questionmark"
        end
    else
        local _, _, _, _, _, _, _, _, _, icon = GetItemInfo(ID)

        if (icon ~= nil) then
            return icon
        else
            return "Interface\\Icons\\inv_misc_questionmark"
        end
    end
end

function DraenorTreasures:OnEnter(mapFile, coord)
    if (not nodes[mapFile][coord]) then return end
    
    local tooltip = self:GetParent() == WorldMapButton and WorldMapTooltip or GameTooltip

    if ( self:GetCenter() > UIParent:GetCenter() ) then
        tooltip:SetOwner(self, "ANCHOR_LEFT")
    else
        tooltip:SetOwner(self, "ANCHOR_RIGHT")
    end

    tooltip:SetText(nodes[mapFile][coord][2])
    if (nodes[mapFile][coord][3] ~= nil) and (DraenorTreasures.db.profile.show_loot == true) then
        if ((nodes[mapFile][coord][7] ~= nil) and (nodes[mapFile][coord][7] ~= "")) then
            tooltip:AddLine(("掉落: " .. GetItem(nodes[mapFile][coord][7])), nil, nil, nil, true)

            if ((nodes[mapFile][coord][3] ~= nil) and (nodes[mapFile][coord][3] ~= "")) then
                tooltip:AddLine(("掉落資訊: " .. nodes[mapFile][coord][3]), nil, nil, nil, true)
            end
        else
            tooltip:AddLine(("掉落: " .. nodes[mapFile][coord][3]), nil, nil, nil, true)
        end
    end

    if (nodes[mapFile][coord][4] ~= "") and (DraenorTreasures.db.profile.show_notes == true) then
     tooltip:AddLine(("註記: " .. nodes[mapFile][coord][4]), nil, nil, nil, true)
    end

    tooltip:Show()
end

local isMoving = false
local info = {}
local clickedMapFile = nil
local clickedCoord = nil

local function generateMenu(button, level)
    if (not level) then return end

    for k in pairs(info) do info[k] = nil end

    if (level == 1) then
        info.isTitle = 1
        info.text = "德拉諾寶藏"
        info.notCheckable = 1
        UIDropDownMenu_AddButton(info, level)
        
        info.disabled = nil
        info.isTitle = nil
        info.notCheckable = nil
        info.text = "從此地圖刪除此物件"
        info.func = DTDisableTreasure
        info.arg1 = clickedMapFile
        info.arg2 = clickedCoord
        UIDropDownMenu_AddButton(info, level)
        
        if isTomTomloaded == true then
            info.text = "增加此位置到TomTom路徑點"
            info.func = DTaddtoTomTom
            info.arg1 = clickedMapFile
            info.arg2 = clickedCoord
            UIDropDownMenu_AddButton(info, level)
        end

        if isDBMloaded == true then
            info.text = "為此位置增加DBM箭頭"
            info.func = DTAddDBMArrow
            info.arg1 = clickedMapFile
            info.arg2 = clickedCoord
            UIDropDownMenu_AddButton(info, level)
            
            info.text = "隱藏DBM箭頭"
            info.func = DTHideDBMArrow
            UIDropDownMenu_AddButton(info, level)
        end

        info.text = CLOSE
        info.func = function() CloseDropDownMenus() end
        info.arg1 = nil
        info.arg2 = nil
        info.notCheckable = 1
        UIDropDownMenu_AddButton(info, level)

        info.text = "恢復刪除的物件"
        info.func = DTResetDB
        info.arg1 = nil
        info.arg2 = nil
        info.notCheckable = 1
        UIDropDownMenu_AddButton(info, level)
        
    end
end

local HandyNotes_DraenorTreasuresDropdownMenu = CreateFrame("Frame", "HandyNotes_DraenorTreasuresDropdownMenu")
HandyNotes_DraenorTreasuresDropdownMenu.displayMode = "MENU"
HandyNotes_DraenorTreasuresDropdownMenu.initialize = generateMenu

function DraenorTreasures:OnClick(button, down, mapFile, coord)
    if button == "RightButton" and down then
        clickedMapFile = mapFile
        clickedCoord = coord
        ToggleDropDownMenu(1, nil, HandyNotes_DraenorTreasuresDropdownMenu, self, 0, 0)
    end
end

function DraenorTreasures:OnLeave(mapFile, coord)
    if self:GetParent() == WorldMapButton then
        WorldMapTooltip:Hide()
    else
        GameTooltip:Hide()
    end
end

local options = {
    type = "group",
    name = "德拉諾寶藏",
    desc = "德拉諾寶藏位置",
    get = function(info) return DraenorTreasures.db.profile[info.arg] end,
    set = function(info, v) DraenorTreasures.db.profile[info.arg] = v; DraenorTreasures:Refresh() end,
    args = {
        desc = {
            name = "一般設定",
            type = "description",
            order = 0,
        },
        icon_scale_treasures = {
            type = "range",
            name = "寶藏圖示大小",
            desc = "圖示的大小",
            min = 0.25, max = 3, step = 0.01,
            arg = "icon_scale_treasures",
            order = 1,
        },
        icon_scale_rares = {
            type = "range",
            name = "稀有圖示大小",
            desc = "圖示的大小",
            min = 0.25, max = 3, step = 0.01,
            arg = "icon_scale_rares",
            order = 2,
        },
        icon_alpha = {
            type = "range",
            name = "圖示透明度",
            desc = "圖示的透明度",
            min = 0, max = 1, step = 0.01,
            arg = "icon_alpha",
            order = 20,
        },
        VisibilityOptions = {
            type = "group",
            name = "可見性設定",
            desc = "可見性設定",
            args = {
                VisibilityGroup = {
                    type = "group",
                    order = 0,
                    name = "選擇哪些區域要顯示什麼:",
                    inline = true,
                    args = {
                        groupSMV = {
                            type = "header",
                            name = "影月谷",
                            desc = "Shadowmoon Valley",
                            order = 0,
                        },
                        treasureSMV = {
                            type = "toggle",
                            arg = "treasure_smv",
                            name = "寶藏",
                            desc = "給各種物品的寶藏",
                            order = 1,
                            width = "half",
                        },
                        rareSMV = {
                            type = "toggle",
                            arg = "rare_smv",
                            name = "稀有",
                            desc = "適合升級中玩家的稀有怪物",
                            order = 2,
                            width = "half",
                        },
                        rareHSMV = {
                            type = "toggle",
                            arg = "rare_h_smv",
                            name = "100等稀有",
                            desc = "適合滿級玩家的稀有怪物",
                            order = 3,
                            width = "normal",
                        },
                        groupFFR = {
                            type = "header",
                            name = "霜火峰",
                            desc = "Frostfire Ridge",
                            order = 10,
                        },  
                        treasureFFR = {
                            type = "toggle",
                            arg = "treasure_ffr",
                            name = "寶藏",
                            desc = "給各種物品的寶藏",
                            width = "half",
                            order = 11,
                        },
                        rareFFR = {
                            type = "toggle",
                            arg = "rare_ffr",
                            name = "稀有",
                            desc = "適合升級中玩家的稀有怪物",
                            width = "half",
                            order = 12,
                        },
                        rareHFFR = {
                            type = "toggle",
                            arg = "rare_h_ffr",
                            name = "100等稀有",
                            desc = "適合滿級玩家的稀有怪物",
                            width = "normal",
                            order = 13,
                        },
                        treasureFFRBSF = {
                            type = "toggle",
                            arg = "treasure_ffr_bsf",
                            name = "劍刃堡壘中的寶藏",
                            desc = "能在劍刃堡壘找到的寶藏",
                            width = "full",
                            order = 14,
                        },
                        groupGG = {
                            type = "header",
                            name = "格古隆德",
                            desc = "格古隆德",
                            order = 20,
                        },  
                        treasureGG = {
                            type = "toggle",
                            arg = "treasure_gg",
                            name = "寶藏",
                            desc = "給各種物品的寶藏",
                            width = "half",
                            order = 21,
                        },
                        rareGG = {
                            type = "toggle",
                            arg = "rare_gg",
                            name = "稀有",
                            desc = "適合升級中玩家的稀有怪物",
                            width = "half",
                            order = 22,
                        },  
                        rareHGG = {
                            type = "toggle",
                            arg = "rare_h_gg",
                            name = "100等稀有",
                            desc = "適合滿級玩家的稀有怪物",
                            width = "normal",
                            order = 23,
                        },  
                        treasureGGL = {
                            type = "toggle",
                            arg = "treasure_gg_l",
                            name = "鋸木廠寶藏",
                            desc = "鋸木廠的寶藏",
                            order = 24,
                        },  
                        treasureGGB = {
                            type = "toggle",
                            arg = "treasure_gg_b",
                            name = "搏擊競技場寶藏",
                            desc = "搏擊競技場的寶藏",
                            order = 25,
                        },  
						overrideGG = {
                            type = "toggle",
                            arg = "gorgrond_override",
                            name = "顯示全部鋸木廠和搏擊競技場寶藏",
                            desc = "不根據你選擇的建築而顯示所有鋸木廠和搏擊競技場的寶藏，這選項需要重載介面才生效",
                            width = "full",
                            order = 26,
                        },  
                        groupTD = {
                            type = "header",
                            name = "塔拉多爾",
                            desc = "Talador",
                            order = 30,
                        },  
                        treasureTD = {
                            type = "toggle",
                            arg = "treasure_td",
                            name = "寶藏",
                            desc = "給各種物品的寶藏",
                            width = "half",
                            order = 31,
                        },
                        rareTD = {
                            type = "toggle",
                            arg = "rare_td",
                            name = "稀有",
                            desc = "適合升級中玩家的稀有怪物",
                            width = "half",
                            order = 32,
                        },  
                        rareHTD = {
                            type = "toggle",
                            arg = "rare_h_td",
                            name = "100等稀有",
                            desc = "適合滿級玩家的稀有怪物",
                            width = "normal",
                            order = 33,
                        },  
                        groupSOA = {
                            type = "header",
                            name = "阿拉卡山",
                            desc = "Spires of Arak",
                            order = 40,
                        },    
                        treasureSOA = {
                            type = "toggle",
                            arg = "treasure_soa",
                            name = "寶藏",
                            desc = "給各種物品的寶藏",
                            width = "half",
                            order = 41,
                        },
                        rareSOA = {
                            type = "toggle",
                            arg = "rare_soa",
                            name = "稀有",
                            desc = "適合升級中玩家的稀有怪物",
                            width = "half",
                            order = 42,
                        },  
                        rareHSOA = {
                            type = "toggle",
                            arg = "rare_h_soa",
                            name = "100等稀有",
                            desc = "適合滿級玩家的稀有怪物",
                            width = "normal",
                            order = 43,
                        },
                        treasureSOAA = {
                            type = "toggle",
                            arg = "treasure_soa_a",
                            name = "考古學寶藏",
                            desc = "阿拉卡考古學寶藏",
                            width = "full",
                            order = 44,
                        },  
                        groupNG = {
                            type = "header",
                            name = "納葛蘭",
                            desc = "Nagrand",
                            order = 50,
                        },      
                        treasureNG = {
                            type = "toggle",
                            arg = "treasure_ng",
                            name = "寶藏",
                            desc = "給各種物品的寶藏",
                            width = "half",
                            order = 51,
                        },
                        rareNG = {
                            type = "toggle",
                            arg = "rare_ng",
                            name = "稀有",
                            desc = "適合升級中玩家的稀有怪物",
                            width = "half",
                            order = 52,
                        },
                        rareHNG = {
                            type = "toggle",
                            arg = "rare_h_ng",
                            name = "100等稀有",
                            desc = "適合滿級玩家的稀有怪物",
                            width = "normal",
                            order = 53,
                        },
                        rareSNG = {
                            type = "toggle",
                            arg = "rare_s_ng",
                            name = "熱砂保護協會稀有怪物",
                            desc = "提供熱砂保護協會聲望的稀有怪物",
                            width = "full",
                            order = 54,
                        },
                        groupTJ = {
                            type = "header",
                            name = "塔南森林",
                            desc = "Tanaan Jungle",
                            order = 60,
                        },
                        treasureTJ = {
                            type = "toggle",
                            arg = "treasure_tj",
                            name = "寶藏",
                            desc = "給各種物品的寶藏",
                            width = "half",
                            order = 61,
                        },
                        rareHTJ = {
                            type = "toggle",
                            arg = "rare_h_tj",
                            name = "100等稀有",
                            desc = "適合滿級玩家的稀有怪物",
                            width = "normal",
                            order = 62,
                        },
                        rareATJ = {
                            type = "toggle",
                            arg = "rare_a_tj_new",
                            name = "只顯示[叢林潛獵者]未擊殺的稀有",
                            desc = "這個選項會優先於[仍然顯示已經擊殺的稀有]",
                            width = "full",
                            order = 63,
                        },
                        groupMount = {
                            type = "header",
                            name = "座騎稀有",
                            desc = "會掉落座騎的稀有",
                            order = 70,
                        },
                        mountTJ = {
                            type = "toggle",
                            arg = "mount_tj",
                            name = "地獄火煞星",
                            desc = "會掉落座騎,提升聲望道具和油料的強大稀有-在塔南森林",
                            order = 71,
                        },
                        mountPR = {
                            type = "toggle",
                            arg = "mount_pr",
                            name = "路行者",
                            desc = "在影月谷",
                            order = 72,
                        },
                        mountPO = {
                            type = "toggle",
                            arg = "mount_po",
                            name = "重拳",
                            desc = "在格古隆德",
                            order = 73,
                        },
                        mountGO = {
                            type = "toggle",
                            arg = "mount_go",
                            name = "格洛克",
                            desc = "在霜火峰",
                            order = 74,
                        },
                        mountSI = {
                            type = "toggle",
                            arg = "mount_si",
                            name = "辛爾特海德",
                            desc = "在塔拉多爾",
                            order = 75,
                        },
                        mountLU = {
                            type = "toggle",
                            arg = "mount_lu",
                            name = "盧可哈克",
                            desc = "在納葛蘭",
                            order = 76,
                        },
                        mountNA = {
                            type = "toggle",
                            arg = "mount_na",
                            name = "『雷鳴者』納克",
                            desc = "在納葛蘭",
                            order = 77,
                        },
                        mountNO = {
                            type = "toggle",
                            arg = "mount_no",
                            name = "諾卡洛許",
                            desc = "在霜火峰",
                            order = 78,
                        },
                        mountVT = {
                            type = "toggle",
                            arg = "mount_vt",
                            name = "真實之緣",
                            desc = "在多個區域",
                            order = 79,
                        },
						groupDH = {
                            type = "header",
                            name = "惡魔獵人",
                            desc = "惡魔獵人專屬區域",
                            order = 80,
                        },    
                        treasureDH = {
                            type = "toggle",
                            arg = "treasure_dh",
                            name = "寶藏",
                            desc = "給各種物品的寶藏",
                            width = "normal",
                            order = 81,
                        },
                        rareDH = {
                            type = "toggle",
                            arg = "rare_dh",
                            name = "稀有",
                            desc = "稀有怪物",
                            width = "normal",
                            order = 82,
                        },  
                    },
                },
                alwaysshowrares = {
                    type = "toggle",
                    arg = "alwaysshowrares",
                    name = "仍然顯示已經擊殺的稀有",
                    desc = "顯示每個稀有不論拾取狀態",
                    order = 100,
                    width = "full",
                },
                alwaysshowtreasures = {
                    type = "toggle",
                    arg = "alwaysshowtreasures",
                    name = "仍然顯示已經擊殺的寶藏",
                    desc = "顯示每個寶藏不論拾取狀態",
                    order = 101,
                    width = "full",
                },
                show_loot = {
                    type = "toggle",
                    arg = "show_loot",
                    name = "顯示掉落",
                    desc = "顯示每個寶藏/稀有的掉落",
                    order = 102,
                },
                show_notes = {
                    type = "toggle",
                    arg = "show_notes",
                    name = "顯示註記",
                    desc = "顯示每個寶藏/稀有的註記如果可用的話",
                    order = 103,
                },
            },
        },
    },
}

function DraenorTreasures:OnInitialize()
    local defaults = {
        profile = {
            icon_scale_treasures = 1.5,
            icon_scale_rares = 2.0,
            icon_alpha = 1.00,
            alwaysshowrares = false,
            alwaysshowtreasures = false,
            save = true,
            treasure_smv = true,
            treasure_ffr = true,
            treasure_ffr_bsf = true,
            treasure_gg = true,
            treasure_gg_b = true,
            treasure_gg_l = true,
            treasure_ng = true,
            treasure_soa = true,
            treasure_soa_a = true,
            treasure_td = true,
            treasure_tj = true,
			treasure_dh = true,
            rare_smv = true,
            rare_ffr = true,
            rare_gg = true,
            rare_td = true,
            rare_soa = true,
            rare_ng = true,
            rare_h_gg = true,
            rare_h_ffr = true,
            rare_s_gg = true,
            rare_h_td = true,
            rare_h_soa = true,
            rare_h_ng = true,
            rare_h_tj = true,
            rare_s_gg = true,
            rare_s_ng = true,
            rare_a_tj_new = false,
			rare_dh = true,
            mount_tj = true,
            mount_pr = true,
            mount_go = true,
            mount_no = true,
            mount_po = true,
            mount_si = true,
            mount_na = true,
            mount_lu = true,
            mount_vt = true,
			gorgrond_override = false,
            world_bosses = true,
            show_loot = true,
            show_notes = true,
        },
    }

    self.db = LibStub("AceDB-3.0"):New("DraenorTreasuresDB", defaults, "Default")
    self:RegisterEvent("PLAYER_ENTERING_WORLD", "WorldEnter")
end

function DraenorTreasures:WorldEnter()
    self:UnregisterEvent("PLAYER_ENTERING_WORLD")
    self:ScheduleTimer("QuestCheck", 5)
    self:ScheduleTimer("RegisterWithHandyNotes", 8)
	self:ScheduleTimer("LoadCheck",6)
	--self:ScheduleTimer("LoginMessage", 10)
end

function DraenorTreasures:QuestCheck()
    do
        if ((IsQuestFlaggedCompleted(36386) == false) or (IsQuestFlaggedCompleted(36390) == false) or (IsQuestFlaggedCompleted(36389) == false) or (IsQuestFlaggedCompleted(36392) == false) or (IsQuestFlaggedCompleted(36388) == false) or (IsQuestFlaggedCompleted(36381) == false)) then
			nodes["SpiresOfArak"][43901500]={ "36395", "暗影視界藥劑", "", "用來拾取安祖的贈禮; 當你獲得所有安祖的贈禮後,此標記會從地圖上移除", "default", "treasure_soa","115463"}
			nodes["SpiresOfArak"][43802470]={ "36397", "暗影視界藥劑", "", "用來拾取安祖的贈禮; 當你獲得所有安祖的贈禮後,此標記會從地圖上移除", "default", "treasure_soa","115463"}
			nodes["SpiresOfArak"][69204330]={ "36398", "暗影視界藥劑", "", "用來拾取安祖的贈禮; 當你獲得所有安祖的贈禮後,此標記會從地圖上移除", "default", "treasure_soa","115463"}
			nodes["SpiresOfArak"][48906250]={ "36399", "暗影視界藥劑", "", "用來拾取安祖的贈禮; 當你獲得所有安祖的贈禮後,此標記會從地圖上移除", "default", "treasure_soa","115463"}
			nodes["SpiresOfArak"][55602200]={ "36400", "暗影視界藥劑", "", "用來拾取安祖的贈禮; 當你獲得所有安祖的贈禮後,此標記會從地圖上移除", "default", "treasure_soa","115463"}
			nodes["SpiresOfArak"][53108450]={ "36401", "暗影視界藥劑", "", "用來拾取安祖的贈禮; 當你獲得所有安祖的贈禮後,此標記會從地圖上移除", "default", "treasure_soa","115463"}
        end
        if (IsQuestFlaggedCompleted(36249) or IsQuestFlaggedCompleted(36250) or DraenorTreasures.db.profile.gorgrond_override == true) then
            --Gorgrond Lumber Mill is active if either of these Quest IDs are true
			nodes["Gorgrond"][49074846]={ "35952", "老舊的石箱", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][42345477]={ "36003", "老舊的石箱", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][47514363]={ "36717", "老舊的石箱", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][53354679]={ "35701", "遠古泰坦寶箱", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][50155376]={ "35984", "遠古泰坦寶箱", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][42084607]={ "36720", "遠古泰坦寶箱", "", "在山洞內", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][41988155]={ "35982", "波塔尼精華種子", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][49657883]={ "35968", "被遺忘的巨魔寶藏", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][47016905]={ "35971", "被遺忘的顱骨堆", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][45808931]={ "36019", "被遺忘的顱骨堆", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][39335627]={ "36716", "被遺忘的顱骨堆", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][56745727]={ "35965", "神秘的硬化之莢", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][41147726]={ "35980", "神秘的硬化之莢", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][60507276]={ "36015", "神秘的硬化之莢", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][63285719]={ "36430", "神秘的硬化之莢", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][47647679]={ "36714", "神秘的硬化之莢", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][51756909]={ "36715", "神秘的硬化之莢", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][40956732]={ "35979", "黑曜水晶陣列", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][45969357]={ "35975", "探險工程師托德克‧灰燈的遺骸", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][51806148]={ "35966", "格林尼爾‧灰掘的遺骸", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][51647226]={ "35967", "未知的硬化蛋", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][45318195]={ "35981", "未知的硬化蛋", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][42914350]={ "36001", "未知的硬化蛋", "", "", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][53007906]={ "36713", "未知的硬化蛋", "", "在山洞內", "default", "treasure_gg_l","824"}
			nodes["Gorgrond"][47245180]={ "36718", "未知的硬化蛋", "", "", "default", "treasure_gg_l","824"}
        end
        if (IsQuestFlaggedCompleted(36251) or IsQuestFlaggedCompleted(36252) or DraenorTreasures.db.profile.gorgrond_override == true) then
            --Gorgrond Sparring Arena is active if either of these Quest IDs are true
			nodes["Gorgrond"][45634931]={ "36722", "老舊的石箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][43224574]={ "36723", "老舊的石箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][41764527]={ "36726", "老舊的石箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][48115516]={ "36730", "老舊的石箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][51334055]={ "36734", "老舊的石箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][46056305]={ "36736", "老舊的石箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][58125146]={ "36739", "老舊的石箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][59567275]={ "36781", "老舊的石箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][45748821]={ "36784", "老舊的石箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][45544298]={ "36733", "古代巨魔寶藏", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][45076993]={ "36737", "古代巨魔寶藏", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][61555855]={ "36740", "古代巨魔寶藏", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][54257313]={ "36782", "古代巨魔寶藏", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][42179308]={ "36787", "古代巨魔寶藏", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][41528652]={ "36789", "古代巨魔寶藏", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][49425084]={ "36710", "遠古泰坦寶箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][42195203]={ "36727", "遠古泰坦寶箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][43365169]={ "36731", "遠古泰坦寶箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][47923998]={ "36735", "遠古泰坦寶箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][50326658]={ "36738", "遠古泰坦寶箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][49128248]={ "36783", "遠古泰坦寶箱", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][48114638]={ "36721", "黑曜水晶陣列", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][41855889]={ "36728", "黑曜水晶陣列", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][42056429]={ "36729", "黑曜水晶陣列", "", "", "default", "treasure_gg_b","824"}
			nodes["Gorgrond"][44184665]={ "36732", "黑曜水晶陣列", "", "", "default", "treasure_gg_b","824"}
		end
	if ((IsQuestFlaggedCompleted(35576) == false) or (IsQuestFlaggedCompleted(35577) == false) or (IsQuestFlaggedCompleted(35579) == false) or (IsQuestFlaggedCompleted(35583) == false)) then
		nodes["NagrandDraenor"][53407320]={ "900003", "熱砂滑翔裝置 (探險者碧絲比)", "沒有", "你需要使用山下的哥布林火箭來到達她的位置; 使用滑翔裝置來拿到4個寶藏 (西北1,西南1,南1,西1); 當你獲得所有相關的寶藏後,此標記會從地圖上移除", "glider", "treasure_ng",""}
	end
	if ((IsQuestFlaggedCompleted(35576) == false) or (IsQuestFlaggedCompleted(35577) == false) or (IsQuestFlaggedCompleted(35579) == false) or (IsQuestFlaggedCompleted(35583) == false) or (IsQuestFlaggedCompleted(36050) == false)) then
		nodes["NagrandDraenor"][58507630]={ "900008", "哥布林火箭", "沒有", "使用它來到達山上熱砂滑翔裝置的位置; 當你獲得所有相關的寶藏後,此標記會從地圖上移除", "rocket", "treasure_ng",""}
	end
	if ((IsQuestFlaggedCompleted(35643) == false) or (IsQuestFlaggedCompleted(35646) == false) or (IsQuestFlaggedCompleted(35648) == false)) then
		nodes["NagrandDraenor"][67601420]={ "900004", "熱砂滑翔裝置 (探險者黛茲)", "沒有", "需要從元素高原的東邊上去; 使用滑翔裝置來拿到3個寶藏 (西南1,東1,東南1); 當你獲得所有相關的寶藏後,此標記會從地圖上移除", "glider", "treasure_ng",""}
	end
	if ((IsQuestFlaggedCompleted(35616) == false) or (IsQuestFlaggedCompleted(35622) == false) or (IsQuestFlaggedCompleted(35623) == false)) then
		nodes["NagrandDraenor"][87204100]={ "900005", "熱砂滑翔裝置 (探險者賈里斯)", "沒有", "使用滑翔裝置來拿到2個寶藏,1個稀有 (東1,南1,東南1); 當你獲得所有相關的寶藏後,此標記會從地圖上移除", "glider", "treasure_ng",""}
	end
	if ((IsQuestFlaggedCompleted(35590) == false) or (IsQuestFlaggedCompleted(35591) == false) or (IsQuestFlaggedCompleted(35593) == false)) then
		nodes["NagrandDraenor"][75606460]={ "900006", "熱砂滑翔裝置 (探險者拉茲克)", "沒有", "在山頂上; 使用滑翔裝置來拿到3個寶藏 (北1,西北1,東1); 當你獲得所有相關的寶藏後,此標記會從地圖上移除", "glider", "treasure_ng",""}
	end
	if ((IsQuestFlaggedCompleted(35660) == false) or (IsQuestFlaggedCompleted(35661) == false) or (IsQuestFlaggedCompleted(35662) == false)) then
		nodes["NagrandDraenor"][83803380]={ "900007", "熱砂滑翔裝置 (探險者倫佐)", "沒有", "在山頂上; 使用滑翔裝置來拿到3個寶藏 (東北2,西南1); 當你獲得所有相關的寶藏後,此標記會從地圖上移除", "glider", "treasure_ng",""}
	end
	if ((IsQuestFlaggedCompleted(35673) == false) or (IsQuestFlaggedCompleted(35678) == false) or (IsQuestFlaggedCompleted(35682) == false)) then
		nodes["NagrandDraenor"][76107300]={ "900009", "熱砂滑翔裝置 (探險者緹娜)", "沒有", "使用滑翔裝置來拿到3個寶藏 (北1,西北1,西南1); 當你獲得所有相關的寶藏後,此標記會從地圖上移除", "glider", "treasure_ng",""}
        end
    end
end

function DraenorTreasures:RegisterWithHandyNotes()
    do
        local function iter(t, prestate)
            if not t then return nil end

            local state, value = next(t, prestate)

            while state do
                if (value[1] and self.db.profile[value[6]] and not DraenorTreasures:HasBeenLooted(value)) and (value[6] == "rare_h_tj") then
                    if (self.db.profile.rare_a_tj_new) then
                        if ((value[8] ~= nil) and (value[8] ~= "")) then
                            local _, _, completed, _, _, _, _, _, _, _, _ = GetAchievementCriteriaInfoByID(10070, value[8])

                            if (completed == false) then
                                if ((value[7] ~= nil) and (value[7] ~= "")) then
                                    GetIcon(value[7]) --this should precache the Item, so that the loot is correctly returned
                                end

                                if ((value[5] == "default") or (value[5] == "unknown")) then
                                    if ((value[7] ~= nil) and (value[7] ~= "")) then
                                        return state, nil, GetIcon(value[7]), DraenorTreasures.db.profile.icon_scale_treasures, DraenorTreasures.db.profile.icon_alpha
                                    else
                                        return state, nil, iconDefaults[value[5]], DraenorTreasures.db.profile.icon_scale_treasures, DraenorTreasures.db.profile.icon_alpha
                                    end
                                end

                                return state, nil, iconDefaults[value[5]], DraenorTreasures.db.profile.icon_scale_rares, DraenorTreasures.db.profile.icon_alpha
                            end
                        end
                    else
                        if ((value[7] ~= nil) and (value[7] ~= "")) then
                            GetIcon(value[7]) --this should precache the Item, so that the loot is correctly returned
                        end

                        if ((value[5] == "default") or (value[5] == "unknown")) then
                            if ((value[7] ~= nil) and (value[7] ~= "")) then
                                return state, nil, GetIcon(value[7]), DraenorTreasures.db.profile.icon_scale_treasures, DraenorTreasures.db.profile.icon_alpha
                            else
                                return state, nil, iconDefaults[value[5]], DraenorTreasures.db.profile.icon_scale_treasures, DraenorTreasures.db.profile.icon_alpha
                            end
                        end

                        return state, nil, iconDefaults[value[5]], DraenorTreasures.db.profile.icon_scale_rares, DraenorTreasures.db.profile.icon_alpha 
                    end
                end

                -- QuestID[1], Name[2], Loot[3], Notes[4], Icon[5], Tag[6], ItemID[7]
                if (value[1] and self.db.profile[value[6]] and not DraenorTreasures:HasBeenLooted(value)) and (value[6] ~= "rare_h_tj") then
                    if ((value[7] ~= nil) and (value[7] ~= "")) then
                        GetIcon(value[7]) --this should precache the Item, so that the loot is correctly returned
                    end

                    if ((value[5] == "default") or (value[5] == "unknown")) then
                        if ((value[7] ~= nil) and (value[7] ~= "")) then
                            return state, nil, GetIcon(value[7]), DraenorTreasures.db.profile.icon_scale_treasures, DraenorTreasures.db.profile.icon_alpha
                        else
                            return state, nil, iconDefaults[value[5]], DraenorTreasures.db.profile.icon_scale_treasures, DraenorTreasures.db.profile.icon_alpha
                        end
                    end

                    return state, nil, iconDefaults[value[5]], DraenorTreasures.db.profile.icon_scale_rares, DraenorTreasures.db.profile.icon_alpha
                end

                state, value = next(t, state)
            end
        end

        function DraenorTreasures:GetNodes(mapFile, isMinimapUpdate, dungeonLevel)
            return iter, nodes[mapFile], nil
        end
    end

    HandyNotes:RegisterPluginDB("德拉諾寶藏", self, options)
    self:RegisterBucketEvent({ "LOOT_CLOSED" }, 2, "Refresh")
    self:Refresh()
end
 
function DraenorTreasures:Refresh()
    self:SendMessage("HandyNotes_NotifyUpdate", "DraenorTreasures")
end

function DTResetDB()
    table.wipe(DraenorTreasures.db.char)
    DraenorTreasures:Refresh()
end

function DraenorTreasures:HasBeenLooted(value)
    if (self.db.profile.alwaysshowtreasures and (string.find(value[6], "treasure") ~= nil)) then return false end
    if (self.db.profile.alwaysshowrares and (string.find(value[6], "treasure") == nil)) then return false end
    if (DraenorTreasures.db.char[value[1]] and self.db.profile.save) then return true end
    if (IsQuestFlaggedCompleted(value[1])) then
        return true
    end

    return false
end

function DTDisableTreasure(button, mapFile, coord)
    if (nodes[mapFile][coord][1] ~= nil) then
        DraenorTreasures.db.char[nodes[mapFile][coord][1]] = true;
    end

    DraenorTreasures:Refresh()
end

function DraenorTreasures:LoadCheck()
	if (IsAddOnLoaded("TomTom")) then 
		isTomTomloaded = true
	end

	if (IsAddOnLoaded("DBM-Core")) then 
		isDBMloaded = true
	end

	if (IsAddOnLoaded("HandyNotes_LegionRaresTreasures")) then 
		isHN_LRTloaded = true
	end

	if isDBMloaded == true then
		local ArrowDesc = DBMArrow:CreateFontString(nil, "OVERLAY", "GameTooltipText")
		ArrowDesc:SetWidth(400)
		ArrowDesc:SetHeight(100)
		ArrowDesc:SetPoint("CENTER", DBMArrow, "CENTER", 0, -35)
		ArrowDesc:SetTextColor(1, 1, 1, 1)
		ArrowDesc:SetJustifyH("CENTER")
		DBMArrow.Desc = ArrowDesc
	end
end

function DTaddtoTomTom(button, mapFile, coord)
    if isTomTomloaded == true then
        local mapId = HandyNotes:GetMapFiletoMapID(mapFile)
        local x, y = HandyNotes:getXY(coord)
        local desc = nodes[mapFile][coord][2];

        if (nodes[mapFile][coord][3] ~= nil) and (DraenorTreasures.db.profile.show_loot == true) then
            if ((nodes[mapFile][coord][7] ~= nil) and (nodes[mapFile][coord][7] ~= "")) then
                desc = desc.."\n掉落: " .. GetItem(nodes[mapFile][coord][7]);
                desc = desc.."\n掉落資訊: " .. nodes[mapFile][coord][3];
            else
                desc = desc.."\n掉落: " .. nodes[mapFile][coord][3];
            end
        end

        if (nodes[mapFile][coord][4] ~= "") and (DraenorTreasures.db.profile.show_notes == true) then
            desc = desc.."\nNotes: " .. nodes[mapFile][coord][4]
        end

        TomTom:AddMFWaypoint(mapId, nil, x, y, {
            title = desc,
            persistent = nil,
            minimap = true,
            world = true
        })
    end
end

function DTAddDBMArrow(button, mapFile, coord)
    if isDBMloaded == true then
        local mapId = HandyNotes:GetMapFiletoMapID(mapFile)
        local x, y = HandyNotes:getXY(coord)
        local desc = nodes[mapFile][coord][2];

        if (nodes[mapFile][coord][3] ~= nil) and (DraenorTreasures.db.profile.show_loot == true) then
            if ((nodes[mapFile][coord][7] ~= nil) and (nodes[mapFile][coord][7] ~= "")) then
                desc = desc.."\n掉落: " .. GetItem(nodes[mapFile][coord][7]);
                desc = desc.."\n掉落資訊: " .. nodes[mapFile][coord][3];
            else
                desc = desc.."\n掉落: " .. nodes[mapFile][coord][3];
            end
        end

        if (nodes[mapFile][coord][4] ~= "") and (DraenorTreasures.db.profile.show_notes == true) then
            desc = desc.."\nNotes: " .. nodes[mapFile][coord][4]
        end
		if not DBMArrow.Desc:IsShown() then
			DBMArrow.Desc:Show()
		end

        x = x*100
        y = y*100
		DBMArrow.Desc:SetText(desc)
		DBM.Arrow:ShowRunTo(x, y, nil, nil, true)
    end
end

function DTHideDBMArrow()
    DBM.Arrow:Hide(true)
end

function DraenorTreasures:LoginMessage()
	if isHN_LRTloaded == false then
	print("|cff00E5EE<|cffFFC125HandyNotes:德拉諾寶藏|cff00E5EE>|cff00ff00為了增加軍臨天下的體驗，此插件暫時增加|cffA330C9惡魔獵人|cff00ff00的寶藏和稀有")
	--print("|cff00ff00These together with all the treasures and rares in the new legion zones can be found in the new addon |cffff0000Handynotes_LegionRares&Treasures |cff00ff00available through Curse.com")
	--print("|cff00ccffhttp://www.curse.com/addons/wow/handynotes_legionrarestreasures")
	end 
end