local _, Sequences = ... -- Don't touch this

----------------------------------------------------------------骑士----------------------------------------------------------------
Sequences["sqs1"] = {
'/targetenemy [noexists][dead][noharm]',
'/cast 審判',
'/cast 公正之盾',
'/cast 復仇之怒',
'/cast 保護祝福',
'/cast 公正之錘',
'/cast 復仇之盾',
'/cast 制裁之錘',
'/cast 忠誠防衛者',
'/cast 奉獻',
'/cast 提爾之眼(神器)',
'/cast 守護之光',
'/cast 遠古諸王守護者',
'/cast 聖盾術',
}

----------------------------------------------------------------萨满----------------------------------------------------------------
Sequences["sm1"] = {
'/targetenemy [noexists][dead][noharm]',
}
----------------------------------------------------------------战士----------------------------------------------------------------
Sequences["zs1"] = {
'/targetenemy [noexists][dead][noharm]',
}
----------------------------------------------------------------猎人----------------------------------------------------------------

Sequences["lr1"] = {
'/targetenemy [noexists][dead][noharm]',
'/cast 治療寵物',
'/click MisdirectTankButton',
'/cast 野性守護',
'/cast 凶暴野獸',
'/cast 擊殺命令',
'/cast 狂野怒火',
'/cast 威嚇',
'/castsequence reset=4 多重射擊,眼鏡蛇射擊,眼鏡蛇射擊',
'/cast 泰坦雷擊(神兵武器)',
}

Sequences["lrdm1"] = {
'/targetenemy [noexists][dead][noharm]',
'/cast [nochanneling:彈幕]治療寵物',
'/click [nochanneling:彈幕]MisdirectTankButton',
'/cast [nochanneling:彈幕]狂野怒火',
'/cast 彈幕',
}
 
----------------------------------------------------------------小德----------------------------------------------------------------
Sequences["dly1"] = {
'/targetenemy [noexists][dead][noharm]',
'/cast 太陽之怒(日能)',
'/cast 新月(神兵武器)',
'/cast 太陽光束',
'/cast 日炎術(日能)',
'/cast 星湧術',
'/cast 星穹連線',
'/cast 月光之擊(月能)',
'/cast 月火術(月能)',

}
----------------------------------------------------------------牧师----------------------------------------------------------------
 Sequences["ms1"] = {
'/targetenemy [noexists][dead][noharm]',
}
----------------------------------------------------------------盗贼----------------------------------------------------------------
Sequences["dz1"] = {
'/targetenemy [noexists][dead][noharm]',
}
----------------------------------------------------------------术士----------------------------------------------------------------
Sequences["ss1"] = {
'/targetenemy [noexists][dead][noharm]',
}
----------------------------------------------------------------法师----------------------------------------------------------------
Sequences["fs1"] = {
'/targetenemy [noexists][dead][noharm]',
}
----------------------------------------------------------------死亡骑士------------------------------------------------------------
Sequences["swqs1"] = {
'/targetenemy [noexists][dead][noharm]',
'/cast 死者復生',
'/cast 黑暗變身',
'/cast 死亡之握',
'/cast 黑暗仲裁者',
'/cast 反魔法護罩',
'/cast 天啟(神兵武器)',
'/cast 膿瘡潰擊',
'/cast 死亡纏繞',
'/cast 疫情蔓延',
'/cast 疫病爆發',
'/cast 死亡打擊',
'/cast 天譴打擊',
}


----------------------------------------------------------------暗影猎手------------------------------------------------------------
Sequences["ayls1"] = {
'/targetenemy [noexists][dead][noharm]',
}
----------------------------------------------------------------熊猫人--------------------------------------------------------------
Sequences["xmr1"] = {
'/targetenemy [noexists][dead][noharm]',
'/cast 滅寂猛攻',
'/cast 火焰吐息',
'/cast 清心絕釀',
'/cast 酒罈破',
'/cast 虎掌',

}
